{
    "recipes": [
        {
            "name": "Christmas pie",
            "url": "https://www.bbcgoodfood.com/recipes/2793/christmas-pie",
            "author": "Mary Cadogan",
            "ingredients": [
                "2 tbsp olive oil",
                "knob butter",
                "1 onion, finely chopped",
                "500g sausagemeat or skinned sausages",
                "grated zest of 1 lemon",
                "100g fresh white breadcrumbs",
                "85g ready-to-eat dried apricots, chopped",
                "50g chestnut, canned or vacuum-packed, chopped",
                "2 tsp chopped fresh or 1tsp dried thyme",
                "100g cranberries, fresh or frozen",
                "500g boneless, skinless chicken breasts",
                "500g pack ready-made shortcrust pastry",
                "beaten egg, to glaze"
            ],
            "method": [
                "Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil and the butter in a frying pan, then add the onion and fry for 5 mins until softened. Cool slightly. Tip the sausagemeat, lemon zest, breadcrumbs, apricots, chestnuts and thyme into a bowl. Add the onion and cranberries, and mix everything together with your hands, adding plenty of pepper and a little salt.",
                "Cut each chicken breast into three fillets lengthwise and season all over with salt and pepper. Heat the remaining oil in the frying pan, and fry the chicken fillets quickly until browned, about 6-8 mins.",
                "Roll out two-thirds of the pastry to line a 20-23cm springform or deep loose-based tart tin. Press in half the sausage mix and spread to level. Then add the chicken pieces in one layer and cover with the rest of the sausage. Press down lightly.",
                "Roll out the remaining pastry. Brush the edges of the pastry with beaten egg and cover with the pastry lid. Pinch the edges to seal, then trim. Brush the top of the pie with egg, then roll out the trimmings to make holly leaf shapes and berries. Decorate the pie and brush again with egg.",
                "Set the tin on a baking sheet and bake for 50-60 mins, then cool in the tin for 15 mins. Remove and leave to cool completely. Serve with a winter salad and pickles."
            ]
        },
        {
            "name": "Malt chocolate cheesecake",
            "url": "https://www.bbcgoodfood.com/recipes/988642/malt-chocolate-cheesecake",
            "author": "Sarah Cook",
            "ingredients": [
                "200g malted milk biscuit, crushed to crumbs",
                "100g salted butter, melted",
                "5 tbsp caster sugar",
                "2 x 300g tubs full fat soft cheese(we used Philadelphia; if you use soft or cream cheese from a deli counter the cheesecake might not set)",
                "300ml pot double cream",
                "300g white chocolate, melted",
                "200g bar milk chocolate, melted",
                "2 tbsp malt or Horlickspowder",
                "37g bag white Maltesers"
            ],
            "method": [
                "Line base and sides of a deep, 22-23cm loose-bottomed round tin with baking parchment. Mix the biscuits, melted butter and 2 tbsp of the sugar, then press into base. Chill while you make the filling.",
                "Divide cream cheese and cream evenly between 2 bowls. Add the white chocolate to one, and the milk chocolate, malt and remaining 3 tbsp sugar to the other. Beat each with an electric whisk until smooth.",
                "Spread the milk chocolate mixture evenly in the tin. Wipe round the edge to give a smooth edge. Spoon the white chocolate mix over the top and gently smooth. Decorate with Maltesers and chill for at least 5 hrs until firm."
            ]
        },
        {
            "name": "Easy apple fruit cake",
            "url": "https://www.bbcgoodfood.com/recipes/2564/easy-apple-fruit-cake",
            "author": "Jane Hornby",
            "ingredients": [
                "200g butter, softened plus extra for greasing",
                "200g dark muscovado sugar",
                "3 eggs, beaten",
                "1 tbsp black treacle",
                "200g self-raising flour",
                "2 tsp mixed spice",
                "1 tsp baking powder",
                "2 eating apples, grated (approx 100g each)",
                "300g mixed sultanas and raisins"
            ],
            "method": [
                "Heat oven to 180C/fan 160C/gas 4. Butter and line the bottom of a deep, round 20cm cake tin with greaseproof paper. Beat the first seven ingredients together in a large bowl (electric hand- beaters are best for this), until pale and thick. Using a large metal spoon, gently fold in the fruit until evenly combined.",
                "Spoon the batter into the tin and bake for 50 mins-1 hr or until the cake is dark golden, springy to the touch and has shrunk away from the tin slightly. A skewer inserted into the centre will come out clean when it’s ready. Cool completely before decorating. Will keep, wrapped in an airtight container or iced, for up to a week, or can be frozen un-iced for up to a month – defrost fully before decorating."
            ]
        },
        {
            "name": "Little mince pie cakes",
            "url": "https://www.bbcgoodfood.com/recipes/2795/little-mince-pie-cakes",
            "author": "Mary Cadogan",
            "ingredients": [
                "175g self-raising flour",
                "100g light muscovado sugar",
                "1 tsp mixed spice",
                "175g softened butter",
                "3 eggs",
                "2 tbsp milk",
                "about 140g mincemeat",
                "icing sugar, for dusting"
            ],
            "method": [
                "Heat oven to 190C/fan 170C/gas 5. Line 12 bun tins with paper cases. Put the flour, sugar, spice, butter, eggs and milk into a mixing bowl and beat with an electric hand whisk or wooden spoon for 2-3 mins, until the mix is light and fluffy.",
                "Put a spoonful of cake mix in each case, then a rounded tsp of mincemeat. Cover the mincemeat with a spoonful of cake mix and smooth.",
                "Bake for 15-18 mins until golden brown and firm. Dust with icing sugar and serve warm or cold."
            ]
        },
        {
            "name": "Classic iced holly cake",
            "url": "https://www.bbcgoodfood.com/recipes/classic-iced-holly-cake",
            "author": "Sarah Cook",
            "ingredients": [
                "1 x 20cm round or square Suits-all Christmas cake(see 'Goes well with' for the recipe)",
                "5 tbsp apricot jam, warmed and sieved",
                "500g pack marzipan",
                "a little icing sugar, for dusting",
                "1¼kg ready-to-roll white fondant icing",
                "green and red food colouring",
                "edible red glitter",
                "small holly-shaped cutter"
            ],
            "method": [
                "Sit the cake on a cake board or serving plate. Brush the top and sides with some of the jam. Roll out the marzipan on an icing-sugar-dusted surface until large enough to cover the top and sides of the cake – use a piece of string to help you measure. Carefully lift your marzipan on top and smooth down the sides of the cake to stick. Trim the bottom, then brush all over again with more jam.",
                "Make sure your surface is really clean, then dust again with a little icing sugar. Knead 850g of the icing until it is very smooth and pliable. As with the marzipan, roll out the icing, then cover the cake and once again trim any excess from the bottom. Smooth out any bumps or marks with the flats of your hands, rubbing the icing to buff it to a shine.",
                "Pull off about a fifth of the remaining icing and knead in enough red food colouring to give a bright colour. Pinch off small amounts and roll between your fingers to make little ‘berries’. Sprinkle some glitter on a saucer and roll the balls in it to coat completely. Shake off any excess glitter and set aside to firm up.",
                "Knead some green food colouring into the remaining icing and roll it out thinly on an icing-sugar-dusted surface. Stamp out lots of holly leaves and begin sticking them onto your iced cake. Use a paintbrush to moisten the underside of each leaf with a little water – don’t make them too wet though, or the green colour might leak onto the rest of the cake. When you have added enough holly leaves, mix a splash of water into some icing sugar to make a runny but fairly stiff icing, and use this to stick on your glitter berries. Leave the cake for a good couple of hours to dry before cutting into it. The cake will sit happily uncut for up to 2 weeks. Once cut into, keep in an airtight tin for up to a month."
            ]
        },
        {
            "name": "Brandy syrup cream",
            "url": "https://www.bbcgoodfood.com/recipes/brandy-syrup-cream",
            "author": "Sara Buenfeld",
            "ingredients": [
                "300ml pot whipping or double cream",
                "2 tbsp golden syrup",
                "1 tbsp brandy",
                "1 tbsp Disaronno"
            ],
            "method": [
                "Tip the cream into a bowl and add the golden syrup, brandy and Disaronno. Stir to dissolve the syrup, then lightly whip with a hand whisk or electric beaters until the mixture holds its shape. Spoon into a serving bowl, cover and chill until ready to serve."
            ]
        },
        {
            "name": "Triple nut & apple stuffing balls",
            "url": "https://www.bbcgoodfood.com/recipes/triple-nut-apple-stuffing-balls",
            "author": "Good Food",
            "ingredients": [
                "2 tbsp linseeds",
                "1 red onion, halved",
                "1 tbsp olive oil, plus extra for greasing",
                "200g mixed nutsof your choice (we used a combination of pecans, hazelnuts and pistachios)",
                "400g can cooked green lentilsin water, drained",
                "50g breadcrumbs(check the pack as some brands are not vegan)",
                "small bunch sage, chopped",
                "1 small apple, grated"
            ],
            "method": [
                "Put the linseeds in a small bowl and mix with 2 tbsp water, then set aside for 5-10 mins until the water thickens to a gluey consistency. Meanwhile, place the onion in a food processor and whizz until finely chopped. Heat the oil in a frying pan, tip in the onion and cook for 5 mins until softened.",
                "Tip the nuts into the food processor and whizz until coarsely chopped. Sprinkle 3 tbsp of the nuts over a plate and set aside. Add the lentils, breadcrumbs, sage, apple, linseeds (and any liquid in the bowl), onion and plenty of seasoning to the processor. Pulse to blend the mixture until just combined – don’t chop too finely or the stuffing will lose its nice nutty texture.",
                "Line a baking tray with foil and grease with a little oil. Remove the blade from the processor and oil your hands. Scoop out walnut-sized chunks of stuffing, roll into balls, then roll on the plate of chopped nuts to coat. Place on the prepared baking tray. Can be covered with cling film and chilled for up to 2 days, or frozen for 2 months.",
                "Heat oven to 200C/180C fan/gas 6. Unwrap (if chilled) and bake for 25-30 mins until the nuts are a little darker and the balls have firmed up slightly – they will be softer than traditional stuffing balls but will firm up after a few mins cooling. If you’re cooking from frozen, bake for 35-40 mins."
            ]
        },
        {
            "name": "Cranberry & marmalade sauce",
            "url": "https://www.bbcgoodfood.com/recipes/cranberry-marmalade-sauce",
            "author": "Sara Buenfeld",
            "ingredients": [
                "300g pack fresh or frozen cranberries",
                "juice 1 orange",
                "50g light muscovado sugar",
                "100g orange shred marmalade"
            ],
            "method": [
                "Tip the cranberries into a medium pan over a low heat with the orange juice, sugar and marmalade, and stir until the sugar and marmalade melt and the mixture starts to bubble. Cook for 3-5 mins, depending on whether the cranberries are fresh or frozen, as the frozen ones will soften more quickly. They need to be tender but still hold their shape, so try to squash one to see if it is soft enough. The sauce will thicken as it cools, but this has a looser texture than shop-bought. Will keep for 1 week in the fridge."
            ]
        },
        {
            "name": "Chocolate peppermint shooting star cake",
            "url": "https://www.bbcgoodfood.com/recipes/chocolate-peppermint-shooting-star-cake",
            "author": "Cassie Best",
            "ingredients": [
                "225g butter, plus plenty for greasing",
                "200g self-raising flour, plus a little for dusting",
                "100g cocoa powder",
                "300g golden caster sugar",
                "4 large eggs",
                "1 tsp baking powder",
                "100g soured cream",
                "225g butter",
                "300g golden caster sugar",
                "4 large eggs",
                "300g self-raising flour",
                "100g soured cream",
                "1 tsp peppermintextract",
                "100g white chocolate, finely chopped",
                "300g icing sugar",
                "200g butter, softened",
                "¼-½ tsp peppermintextract (depending on its strength)",
                "Malteasers, rolled in edible silver lustre dust",
                "2½ l bundt tin",
                "6cm star cutter"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4 and boil the kettle. First, make the chocolate cake. Liberally grease the bundt tin with butter, then dust with flour and shake out the excess. Put the cocoa in a bowl with a pinch of salt, cover with 150ml hot water from the kettle, mix until smooth, then set aside to cool. Put the butter and sugar in a bowl and whisk until light and fluffy. Add the eggs, one at a time, mixing well between each addition. Sift in the flour and baking powder and fold everything together. Stir the soured cream into the cocoa mixture, then add to the other bowl and mix until just combined, then scrape into the prepared tin. Bake for 35 mins until a skewer comes out clean. Leave to cool for 15 mins in the tin, then turn out onto a wire rack to cool completely.",
                "When the cake is cool, transfer to a baking sheet lined with baking parchment, and make space for the cake and tray in your freezer. Slice the cake into pieces roughly the thickness of your star cutter, then pull each piece out a little, so there is space around each one. Pop the cake in the freezer for 2 hrs, or overnight.",
                "When the cake is firmly frozen, lay each slice on its side, keeping them in the same circular pattern, and cut out a star, using the cutter, from the middle of each piece. Leftover cake can be kept in the freezer for up to 2 months, ready for making a trifle. Return the cut-out stars to the freezer.",
                "Now, make the peppermint cake. Grease the same bundt tin and heat your oven to 180C/160C fan/gas 4. Put the butter and sugar in a bowl and beat until pale and fluffy. Add the eggs, one at a time, mixing well between each, then add the flour, soured cream and peppermint extract. Give everything a good mix and scrape half the mixture into the bundt tin. Remove the stars from the freezer and line up in a circle on top of the cake mixture (pointy sides up) – make sure there are no gaps and that the stars perfectly line up. Spoon the remaining cake mixture on top, easing it around the stars until they are just covered. Bake for 45 mins until risen and golden brown and a skewer poked into the side of the cake comes out clean. Cool in the tin for 10 mins, then turn out onto a wire rack to cool completely.",
                "For the icing, melt the chocolate in short blasts in the microwave, or in a bowl suspended over a pan of barely simmering water, stirring it occasionally. Set aside to cool a little. In a large bowl, beat the icing sugar and butter until pale and smooth. Add the chocolate and peppermint extract, and mix again until combined. When the cake is completely cool, place on a serving plate, then swirl over the chocolate icing, easing it about halfway down the sides to create a snowy effect. Place the Maltesers on top of the cake. Will keep for up to 3 days in a sealed container."
            ]
        },
        {
            "name": "Yummy chocolate log",
            "url": "https://www.bbcgoodfood.com/recipes/8767/yummy-chocolate-log",
            "author": "Sara Buenfeld",
            "ingredients": [
                "3 eggs",
                "85g golden caster sugar",
                "85g plain flour(less 2 tbsp)",
                "2 tbsp cocoa powder",
                "½ tsp baking powder",
                "50g butter",
                "140g dark chocolate, broken into squares",
                "1 tbsp golden syrup",
                "284ml pot double cream",
                "200g icing sugar, sifted",
                "2-3 extra strong mint, crushed (optional)",
                "icing sugarand holly sprigs to decorate - ensure you remove the berries before serving"
            ],
            "method": [
                "Heat oven to 200C/fan 180C/gas 6.",
                "Grease and line a 23 x 32cm Swiss roll tin with baking parchment. ",
                "Beat 3 eggs and 85g golden caster sugar together with an electric whisk for about 8 mins until thick and creamy.\u2028",
                "Mix 85g plain flour (less 2 tbsp), 2 tbsp cocoa powder and ½ tsp baking powder together, then sift onto the egg mixture. Fold in very carefully, then pour into the tin.",
                "Now tip the tin from side to side to spread the mixture into the corners. Bake for 10 mins.",
                "Lay a sheet of baking parchment on the work surface. When the cake is ready, tip it onto the parchment, peel off the lining paper, then roll the cake up from its longest edge with the paper inside. Leave to cool.\u2028",
                "To make the icing, melt 50g butter and 140g dark chocolate together in a bowl over a pan of hot water. Take from the heat and stir in 1 tbsp golden syrup and 5 tbsp double cream from a 284ml pot. Beat in 200g sifted icing sugar until smooth.",
                "Whisk the remaining double cream from the 284ml pot until it holds its shape.",
                "Unravel the cake, spread the cream over the top, scatter over 2-3 crushed extra strong mints, if using, then carefully roll up again into a log.",
                "Cut a thick diagonal slice from one end of the log. Lift the log on to a plate, then arrange the slice on the side with the diagonal cut against the cake to make a branch.",
                "Spread the icing over the log and branch (don’t cover the ends), then use a fork to mark the icing to give the effect of tree bark. Scatter with unsifted icing sugar to resemble snow, and decorate with holly."
            ]
        },
        {
            "name": "Naan, spinach & halloumi bites",
            "url": "https://www.bbcgoodfood.com/recipes/naan-spinach-halloumi-bites",
            "author": "Miriam Nice",
            "ingredients": [
                "2 tbsp butter",
                "2 crushed garlic cloves",
                "2 tsp garam masala",
                "2 x 80g bags washed baby spinach",
                "2 x 250g packs halloumi cheese",
                "4 naan bread"
            ],
            "method": [
                "Warm the butter in a large pan with the crushed garlic cloves and garam masala. Roughly chop the washed baby spinach and add to the melted butter and spices. Cook until the spinach has wilted, then season to taste.",
                "Cut the halloumi into cubes and grill the tops until golden. Heat the naan breads under the grill – just to warm through – then spread with the spinach mixture.",
                "Evenly distribute the grilled halloumi over the bread, then cut the bread to fit the cheese, and secure with cocktail sticks. Serve warm."
            ]
        },
        {
            "name": "Reverse espresso martini",
            "url": "https://www.bbcgoodfood.com/recipes/reverse-martini",
            "author": "Miriam Nice",
            "ingredients": [
                "30ml freshly brewed espresso",
                "50ml vodka",
                "25ml Baileys"
            ],
            "method": [
                "Freeze the espresso in an ice cube tray until frozen solid. Pour the vodka and baileys into a cocktail shaker filled with ice. Stir together for about 1 min then strain into a tumbler. Put 4-5 coffee ice cubes into the drink to serve."
            ]
        },
        {
            "name": "Deep-fried olives",
            "url": "https://www.bbcgoodfood.com/recipes/deep-fried-olives",
            "author": "Miriam Nice",
            "ingredients": [
                "100g pankoor coarse dried breadcrumbs",
                "4 crushed juniper berries",
                "160g feta-stuffed olives",
                "3 tbsp plain flour",
                "1 egg, beaten",
                "300ml vegetable oil",
                "2 tsp dry vermouth",
                "100g mayonnaise",
                "1 tsp lemon juice"
            ],
            "method": [
                "Crush the breadcrumbs in a bag using a ",
                " or in a ",
                ". Tip into a shallow dish with the berries, then season and set aside. Toss the olives in the flour. Put the beaten egg in a large bowl, add the coated olives and move them around to coat. Turn them one by one in the breadcrumb mixture, then put on a plate until ready to fry.",
                "Heat the oil in a large pan to 180C, then fry the olives for 1-2 mins, or until golden and sizzling. Drain on kitchen paper and leave to cool for a few mins as they'll be very hot inside.",
                "To make the lemon and vermouth mayo, mix the vermouth with the mayonnaise and lemon juice. Serve the warm, deep-fried olives alongside the mayo."
            ]
        },
        {
            "name": "Apple pie cookie kit",
            "url": "https://www.bbcgoodfood.com/recipes/apple-pie-cookie-kit",
            "author": "Sarah Cook",
            "ingredients": [
                "175g plain flour",
                "1 tsp mixed spice",
                "1 tsp ground cinnamon",
                "½ tsp bicarbonate of soda",
                "100g light brown soft sugar",
                "50g rolled oat",
                "85g raisinsor sultanas",
                "50g malted milk biscuits, broken into small chunks",
                "1 shiny, perfect apple",
                "1 big jam jaror small Kilner jar (about 750ml capacity)",
                "1 long colourful ribbon",
                "1 sticky labelfor the jar (or tag to tie to the top) and a pen",
                "weighing scales",
                "measuring spoons"
            ],
            "method": [
                "Wash the jar, then dry very well.",
                "Mix the flour with the spices and bicarb, then tip into the jar. Use your fingers to remove any lumps from the sugar, then pour into the jar. Add each of the remaining ingredients, one by one, following the list, until you’ve added the biscuit bits.",
                "When all the ingredients are in the jar, put the lid on tightly. Sit the apple on top of the lid and tie to the jar with ribbon. The mixture and apple will keep for 4 days.",
                "Download our printable label (see tip), or write out the following instructions on a sticky label (or tag) and attach to the jar: Tip everything in the jar into a big mixing bowl and grate in the peeled apple. Melt 50g/2oz butter with 2 tbsp golden syrup and stir into the bowl with 1 egg. Space 10 spoonfuls on greased trays and bake for 15-18 mins at 180C/160C fan/gas 4 until golden and chewy. The cookies will firm up as they cool."
            ]
        },
        {
            "name": "Roast guinea fowl with chestnut, sage & lemon stuffing",
            "url": "https://www.bbcgoodfood.com/recipes/2807666/roast-guinea-fowl-with-chestnut-sage-and-lemon-stu",
            "author": "Sarah Cook",
            "ingredients": [
                "1 small guinea fowl, about 1kg",
                "8 rashers streaky bacon",
                "50g soft butter",
                "1 onion, unpeeled and thickly sliced",
                "2 tbsp plain flour",
                "350ml strong chicken stock",
                "cranberry sauce, roast potatoes and vegetables, to serve",
                "1 onion, chopped",
                "25g butter",
                "1 tbsp chopped sage",
                "50g walnut, finely chopped",
                "50g breadcrumb",
                "zest 2 lemons",
                "¼ tsp ground mace",
                "100g cooked chestnut, quartered",
                "1 medium egg, beaten with a fork"
            ],
            "method": [
                "First make the stuffing. Soften the onion in the butter very gently, then stir in the sage and cook for 2 mins more. Scrape into a bowl with the chopped walnuts, breadcrumbs, lemon zest, mace, chestnuts and egg and mix together well. Season generously.",
                "For the guinea fowl, wash and wipe out the inside cavity. Mix the butter with some seasoning, then push and spread some under the skin over the breasts, and rub the rest over the legs. Lay the bacon across the breasts, smoothing over, and season with some more pepper. Push the stuffing into the cavity (any extra can be rolled into balls and baked in the oven for the last 20 mins cooking time). You can cover and chill the guinea fowl now for up to 24 hours.",
                "To roast, bring the bird out of the fridge 30 mins before. Heat oven to 200C/180C fan/gas 6. Sit the bird in a snug roasting tin with the sliced onion underneath. Roast for 15 mins, then lower the oven to 180C/160C fan/gas 4 and roast for a further 35-45 mins for a 1kg bird (or longer if bigger – use the timings for a roast chicken). Check the bird is done by piercing the inside of the thigh with a knife and making sure the juices are clear, not bloody. Lift the guinea fowl off the onions, onto a platter. Loosely cover with foil, top with a towel (to keep it warm), and rest while you make the gravy.",
                "Pour off the juices from the roasting tray into a jug or bowl, and allow to settle. Spoon a tbsp of the fat on top back into the roasting tray, pop on the hob over a low heat (make sure your roasting tray is suitable or transfer contents to a pan), and stir in the flour until it isn’t dusty anymore. Gradually stir in the stock, plus any meat juices after you’ve discarded the rest of the fat, and bubble gently until thickened. Season with salt, pepper, and pinches of sugar if it needs it, then strain into a gravy jug and discard the onions. Serve with the guinea fowl, spooning out the stuffing as you carve, plus cranberry sauce and plenty of vegetables."
            ]
        },
        {
            "name": "Roasted gnocchi, sundried tomato & olive stacks",
            "url": "https://www.bbcgoodfood.com/recipes/roasted-gnocchi-sundried-tomato-olive-stacks",
            "author": "Miriam Nice",
            "ingredients": [
                "500g pack of fresh gnocchi",
                "4 tbsp olive oil",
                "40 pitted green olives",
                "40 sundried tomatoes",
                "40 basil leaves"
            ],
            "method": [
                "Heat oven to 220C/200C fan/gas 7. Tip the fresh gnocchi in a roasting tin and drizzle with olive oil. Roast for 25-30 mins or until golden, stirring occasionally. Thread the roasted gnocchi onto cocktail sticks with pitted green olives, sundried tomatoes and basil leaves. Serve while the gnocchi is still warm."
            ]
        },
        {
            "name": "Spiced arancello",
            "url": "https://www.bbcgoodfood.com/recipes/8025/spiced-arancello",
            "author": "Good Food",
            "ingredients": [
                "5 large oranges",
                "1 cinnamon stick",
                "2-3 cardamom pods",
                "1 vanilla pod",
                "1l bottle vodka",
                "600g caster sugar",
                "a few extra oranges, cinnamon sticks, cardamom and vanilla pods, to bottle"
            ],
            "method": [
                "Pare the zest from the oranges using a peeler, making sure that none of the bitter white pith is left on the peel. Put the zest, spices and vanilla pod in one large or several smaller clean jars, then tip in the vodka. Seal and leave for a week, shaking the jar each day.",
                "After one week, you’re ready for the next stage. Boil a kettle of water. Put the sugar in a heatproof bowl, then pour over 500ml boiling water, stirring until the sugar dissolves. Add to the vodka mix, then leave for another week, shaking the jar regularly. Strain into decorative bottles, discarding the peel and spices, and store in a cool place until Christmas. Before giving, drop some fresh spices and peel into each bottle to decorate. Will keep bottled for 6 months."
            ]
        },
        {
            "name": "Mince pie martini",
            "url": "https://www.bbcgoodfood.com/recipes/mince-pie-martini",
            "author": "Good Food",
            "ingredients": [
                "100g golden caster sugar",
                "50g mincemeat",
                "4 tbsp caster sugar",
                "4 tsp mixed spice",
                "4 tsp mincemeat",
                "100ml gin",
                "100ml sweet red vermouth",
                "20ml dark rum"
            ],
            "method": [
                "To make a mincemeat syrup, put 100ml water, the golden caster sugar and mincemeat in a pan and bring to the boil. Cool and strain though muslin into a sieve. Separately, mix the caster sugar and mixed spice, then dampen the rims of 4 martini glasses and dip in the sugar and spice mixture.",
                "Muddle the mincemeat in a cocktail shaker (you may need to make in 2 batches), then add the gin, sweet red vermouth, dark rum, 80ml mincemeat syrup and ice. Shake well and strain into your prepared glass."
            ]
        },
        {
            "name": "Hot chocolate set",
            "url": "https://www.bbcgoodfood.com/recipes/hot-chocolate-set",
            "author": "Miriam Nice",
            "ingredients": [
                "sunflower oil, for greasing",
                "50g milk chocolate, chopped",
                "100g dark chocolate, chopped",
                "flaky sea salt",
                "4 cinnamon sticks",
                "4 empty 47g fromage frais pots, washed and dried",
                "4 muffin cases",
                "cellophane and twine or string, for wrapping",
                "4 mugs",
                "gift tagsand pen, for labelling"
            ],
            "method": [
                "Very lightly grease the fromage frais pots with oil and set aside until needed.",
                "Melt the milk chocolate in a bowl set over a pan of just-simmering water, stirring occasionally, then divide between the prepared pots. Place in the fridge or a cold place for around 30 mins or until set.",
                "Once the milk chocolate layer is firm, melt the dark chocolate in a bowl as before, then pour it over the milk chocolate. Leave the pots to set for 15 mins, then sprinkle a pinch of flaky sea salt onto each.",
                "Cut a hole in the bottom of each paper cake case and push a cinnamon stick through. Push the end of the stick into the middle of each pot so that the paper case is upside down – it will help to hold the cinnamon stick in place while it sets.",
                "Leave to set overnight, then turn out and discard the pot and paper case. Wrap each in cellophane tied with twine. Tie each stick to a mug, or simply place inside the mug, and write a tag to read ‘Just add hot milk’."
            ]
        },
        {
            "name": "Hot toddy fruitcake",
            "url": "https://www.bbcgoodfood.com/recipes/2988/hot-toddy-fruitcake",
            "author": "Jane Hornby",
            "ingredients": [
                "200ml hot, strong black tea (use any type)",
                "3 tbsp whisky",
                "3 tbsp good-quality orange marmalade, thin or medium shred",
                "700g mixed dried fruit",
                "100g mixed peel",
                "100g glacé cherry (natural colour)",
                "225g butter",
                "225g golden caster sugar",
                "4 eggs, beaten",
                "225g plain flour",
                "1 tsp ground mixed spice",
                "1 tsp ground cinnamon",
                "finely grated zest 1 lemon",
                "2 tsp caster sugar",
                "50ml hot black tea",
                "1 tbsp whisky(or use orange juice if you prefer)"
            ],
            "method": [
                "Mix the hot tea, whisky and marmalade in a large bowl until the marmalade melts. Stir in all of the dried fruit, peel and cherries, then cover and leave to soak overnight.",
                "Next day, heat oven to 160C/fan 140C/gas 3 and grease and double-line a 20cm round, deep cake tin with non-stick baking paper. Using electric beaters, cream together the butter and sugar until fluffy. Add the eggs a little at a time, beating well after each addition, then fold in the flour and spices, followed by the lemon zest and soaked fruit. Add any liquid that hasn’t been absorbed by the fruit, too. Spoon into the prepared tin, level the top, then bake for 1½ hrs. Turn the oven down to 140C/fan 120C/gas 1 and bake for another 1½ hrs or until a skewer inserted into the centre of the cake comes out clean. Cool on a wire rack in the tin.",
                "While the cake is still warm, use the skewer to pepper the cake with holes, poking it all the way down. Dissolve the sugar in the tea, add the whisky or orange juice, then spoon over the surface. If you’re making the cake ahead of time, feed it with a fresh swig of hot toddy every week, but take care not to make the cake soggy. Can be kept for a month well-wrapped in an airtight container in a cool, dry place. If short on time, the cake can be made the same day that you decorate it."
            ]
        },
        {
            "name": "Rocky robin cake",
            "url": "https://www.bbcgoodfood.com/recipes/889664/rocky-robin-cake",
            "author": "Sarah Cook",
            "ingredients": [
                "1 x 20cm round or 18cm square Christmas cake(see 'Goes well with', below)",
                "4 tbsp raspberryor apricot jam, warmed and sieved",
                "icing sugar, for dusting",
                "500g pack marzipan",
                "1.3kg ready-to-roll white icing",
                "brown, green and red food colouring",
                "9 whole cloves",
                "black writing icing"
            ],
            "method": [
                "Sit the cake on a large board or flat serving plate. Brush a little of the jam over the cake. Dust a clean surface with a little icing sugar, then roll out the marzipan until big enough to cover the cake (use string to help you measure). Carefully lift the marzipan onto the cake, pat down to cover smoothly and trim any excess off the bottom. Brush all over again with more jam.",
                "Knead 1kg white icing until smooth, then roll out on an icing sugar-dusted surface until a little bigger than the marzipan size. Carefully lift onto the cake, partially pat down the sides to smooth and stick, allow the rest to stick in folds, or tease into shape with your fingers (step A). Trim any ragged edges.",
                "For the robins, roll 3 walnut-size balls from some of the remaining white icing. Halve the icing that is left. Knead brown colouring into 1 half to give a rich colour, wrap well – this will be the branch. Divide the other half into 3 pieces, and colour 1 red, 1 pale brown and 1 green.",
                "Re-dust the work surface, pinch off 3 marble-size balls of red icing and roll each into a teardrop shape for the breast. Use a cocktail stick to add texture, then stick 1 onto each robin – brush a little water onto the icing to help it stick. As you stick it, flatten the base of the ball slightly so that the robins stand up.",
                "Divide the pale brown icing into 3 balls and roll each into an oval shape, then pinch 1 end of each into a gentle point (step B). Stick onto the robins so that the point is the head, and trim the tail if you need to. Poke a clove into each brown tip to make a little beak. Pull the round bit off the end of 6 cloves to leave spiky ends, and poke into robins to make feet. Use black writing icing to add eyes (step C).",
                "Roll most of the dark brown icing into a long branch and attach to the cake with a little more water or jam. Roll smaller branches from the remaining dark brown icing. Pinch leaves from the green icing and attach. Add the robins and enjoy."
            ]
        },
        {
            "name": "Gingerbread pancakes",
            "url": "https://www.bbcgoodfood.com/recipes/gingerbread-pancakes",
            "author": "Chelsie Collins",
            "ingredients": [
                "150g self-raising flour",
                "½ tsp baking powder",
                "1 tsp ground ginger",
                "1 tsp cinnamon",
                "2 tsp golden caster sugar",
                "1 egg, beaten",
                "½ tbsp maple syrup, plus extra to serve",
                "200ml full-fat milkor semi-skimmed milk",
                "vegetable oil, for frying",
                "100g pitted dates, chopped, to serve",
                "100ml crème fraîche, to serve"
            ],
            "method": [
                "Put the flour, baking powder, ginger, cinnamon and sugar in a large bowl with a pinch of salt. Combine the egg, maple syrup and milk in a jug. Gradually add to the dry ingredients, whisking until a smooth, silky batter forms.",
                "Heat a drizzle of oil in a large, non-stick pan over a medium heat and ladle 2-3 small rounds into the pan. Cook for 1-2 mins until bubbles start to appear on the surface, then flip over and cook for a further 1 min until fluffy. Do this in batches until you have 10 pancakes.",
                "Serve in a stack, with extra maple syrup, a blob of crème fraîche and dates scattered over."
            ]
        },
        {
            "name": "Pecan toffee cake",
            "url": "https://www.bbcgoodfood.com/recipes/8267/pecan-toffee-cake",
            "author": "Jane Hornby",
            "ingredients": [
                "300g pecanhalves",
                "140g stoned dates",
                "200g butter, softened, plus extra for greasing",
                "200g light muscovado sugar",
                "1 tsp mixed spice",
                "4 eggs, beaten",
                "140g self-raising flour",
                "maple syrup, to serve"
            ],
            "method": [
                "Tip 100g pecans into a processor and whizz until fine, then tip into a bowl. Put the dates into a small pan with enough water to cover, boil for 5 mins until very soft. Drain, discarding the liquid, then whizz in the processor until smooth. Leave to cool.",
                "Heat oven to 180C/fan 160C/gas 4. Butter and line the base of a 23cm cake tin. Beat the butter, sugar and spice together until lighter and creamy, then tip in the dates, ground pecans, eggs and a pinch of salt and beat briefly until smooth.",
                "Fold in the flour with a metal spoon, then spoon into the tin and level the top. Sprinkle the remaining nuts over the top (don’t press them in), then bake for 40 mins or until risen and golden and a skewer comes out clean. Serve warm, with generous drizzles of maple syrup and scoops of Maple crunch ice cream (see 'goes well with')."
            ]
        },
        {
            "name": "Coconut & vanilla milk bottle cocktail",
            "url": "https://www.bbcgoodfood.com/recipes/white-christmas-cocktail",
            "author": "Chelsie Collins",
            "ingredients": [
                "100ml vanilla vodka",
                "160ml coconut cream",
                "1 tbsp crème de cacao",
                "½ tsp grated nutmeg",
                "2 chocolate wafers, to serve"
            ],
            "method": [
                "Put a few ice cubes in a cocktail shaker with the vanilla vodka, coconut cream, crème de cacao and grated nutmeg. Shake and strain into two mini milk bottles (see tip). Pop a rolled chocolate wafer in each."
            ]
        },
        {
            "name": "Brandy butter ice cream",
            "url": "https://www.bbcgoodfood.com/recipes/2760965/brandy-butter-ice-cream",
            "author": "Good Food",
            "ingredients": [
                "140g butter",
                "100ml brandy",
                "300ml milk",
                "2 large egg yolks",
                "175g light soft brown sugar",
                "150ml double cream"
            ],
            "method": [
                "Heat the butter in a small pan until just starting to take on a nutty brown colour – remove from the heat straight away as it will continue to colour. Stir in the brandy, then leave to cool.",
                "Heat the milk in a saucepan but don’t let it boil. Whisk the egg yolks and sugar in a bowl until pale. Pour over the hot milk, whisking continuously, then return to the saucepan set over a low heat. Cook for 3-4 mins, stirring the whole time with a wooden spoon, until the custard thickens enough to coat the back of your spoon. Leave to cool.",
                "Whisk the cream until it forms soft, billowy peaks. Fold in the brandy butter and the custard mixture. Churn in an ice-cream machine until set, then keep in the freezer for up to 2 months."
            ]
        },
        {
            "name": "Burnt sprouts with pomegranate & sesame",
            "url": "https://www.bbcgoodfood.com/recipes/burnt-sprouts-pomegranate-sesame",
            "author": "Barney Desmazery",
            "ingredients": [
                "3 tbsp rapeseed or sunflower oil",
                "400g Brussels sprouts, halved",
                "25g cold butter, diced",
                "1 tbsp sesame seeds",
                "100g pomegranate seeds",
                "drizzle of pomegranate molasses"
            ],
            "method": [
                "Heat the oil in a large frying pan over a medium heat. Put the sprouts in the pan, cut-side down, and leave them to sizzle away happily for 10 mins without disturbing them.",
                "Halfway through cooking, dot over the butter and leave it to sizzle and brown – the sprouts need to be really crispy and dark brown. If they are just lightly brown, carry on cooking for another 5-10 mins.",
                "Scatter over the sesame seeds and stir-fry everything until the seeds are toasted. Off the heat, toss through the pomegranate seeds, then season the sprouts with salt and tip into a serving dish. Drizzle with the pomegranate molasses before serving."
            ]
        },
        {
            "name": "Cranberry sours",
            "url": "https://www.bbcgoodfood.com/recipes/cranberry-sours",
            "author": "Jane Hornby",
            "ingredients": [
                "300g pack frozen cranberries, defrosted",
                "100ml orange liqueur(We used Cointreau)",
                "1 tbsp Disaronnoliqueur",
                "100ml fresh orange juice",
                "2 tbsp lime juice",
                "2-3 tbsp maple syrup, to taste",
                "big bag of crushed ice, to serve"
            ],
            "method": [
                "Put the cranberries, liqueurs, orange and lime juices and the maple syrup into a food processor or blender. Blitz until the berries are as finely chopped as possible.",
                "Strain through a fine sieve, working the cranberry pulp against the mesh with a spatula or small ladle until you have extracted all of the liquid. Chill until needed. When ready to serve, fill small glasses with crushed ice, then pour over the almost fluorescent pink cocktail."
            ]
        },
        {
            "name": "Pomegranate rosemary spritzer",
            "url": "https://www.bbcgoodfood.com/recipes/pomegranate-rosemary-spritzer",
            "author": "Chelsie Collins",
            "ingredients": [
                "200ml pomegranate juice",
                "sprig of rosemary",
                "prosecco",
                "4 rosemarysprigs (optional)"
            ],
            "method": [
                "Put the pomegranate juice in a small saucepan with a sprig of rosemary. Bring to the boil and reduce for a few mins until syrupy. Leave to cool, then chill until ready to use.",
                "Fill four Champagne flutes with 1 part pomegranate syrup and top up with 3 parts Prosecco. Garnish each glass with a rosemary sprig, if you like."
            ]
        },
        {
            "name": "Scallop & apple salad with hazelnut dressing",
            "url": "https://www.bbcgoodfood.com/recipes/2774679/scallop-and-apple-salad-with-hazelnut-dressing",
            "author": "James Martin",
            "ingredients": [
                "½ crisp, green eating apple",
                "juice ½ lemon",
                "2 tbsp finely chopped toasted hazelnut(see dressing)",
                "25g butter",
                "6 scallops, without roe",
                "small handful watercressleaves",
                "2 tsp extra-virgin rapeseed oil, plus extra for drizzling",
                "175g hazelnut(a 200g bag will give you enough for the scallops, too)",
                "3 tbsp cider vinegar",
                "2 tsp maple syrup"
            ],
            "method": [
                "To make the dressing, tip the hazelnuts into a frying pan, toast until golden, then transfer to the small bowl of a food processor. Whizz for 5-10 mins until they make a smooth paste – the nuts will start to release some of their oil and the paste should look like smooth peanut butter. Add the vinegar, maple syrup, season and blend to combine. With the motor running, pour in 150ml water and continue blending until smooth. Can be kept in the fridge for up to 1 week.",
                "Cut the apple into really fine matchsticks using a mandolin or sharp knife. Toss in a little of the lemon juice as you go to prevent the apple from turning brown.",
                "Put the hazelnuts in a shallow dish. Heat the butter in a frying pan until foaming and nut brown. Add the scallops and cook for 1 min on each side, or to your liking, seasoning as they cook. Remove from the pan and roll each scallop in hazelnuts. If cooking for larger numbers, cook the scallops in batches so that you don’t overcrowd the pan.",
                "To serve, spoon a dollop of the hazelnut dressing in the centre of each plate; use the back of the spoon to spread out the dressing slightly. Toss the watercress in the remaining lemon juice and oil, season and place a pile in the centre of each dressing dollop. Arrange the scallops around the watercress and place piles of apple between each scallop. Drizzle with a little oil and serve immediately."
            ]
        },
        {
            "name": "Stuffing baubles",
            "url": "https://www.bbcgoodfood.com/recipes/stuffing-baubles",
            "author": "Good Food",
            "ingredients": [
                "drizzle of vegetable oil, plus extra for greasing",
                "6 small or medium red onions",
                "250g sausagemeat",
                "50g dried cranberries",
                "small bunch thyme, leaves picked",
                "50g fresh or dried breadcrumbs",
                "12 rashers pancetta"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4 and grease a large baking tray. Halve the onions through the root and peel off the papery skin. Cut off any stringy roots but leave the base of the root intact. Slice a little off the rounded side of each onion half, so they will sit on the tray. Cut away the centre of the onions, reserving the offcuts, to leave a hollow – once you’ve cut away a little, you can use your fingers to pull out the layers until you’re left with a shell of 2 or 3 layers. Arrange the halves on a baking tray, season and bake for 10 mins until just softened. Set aside to cool.",
                "Weigh the onion offcuts and place 140g/5oz in a food processor (save any remaining onions for another recipe). Blitz until finely chopped but still with a little texture – or finely chop by hand. Heat a drizzle of oil in a frying pan and add the onions. Cook for 5 mins until softened, then set aside to cool.",
                "Tip the sausagemeat, cranberries, thyme and breadcrumbs into a bowl. Add the fried onions and a little seasoning. Mix well. Roll the stuffing mixture into 12 balls and use to fill the onion halves. Wrap a slice of pancetta around each ‘bauble’, ensuring the ends meet underneath the onions. Can now be covered with cling film and chilled for up to 2 days or frozen for up to a month.",
                "Heat oven to 200C/180C fan/gas 6. Unwrap the stuffing baubles (if chilled) and bake for 25 mins until cooked through and the bacon is starting to crisp. If you’re cooking from frozen, bake for 35 mins. (If you have a full oven, it may be too steamy to crisp up the bacon, so finish with a blast under a hot grill until nicely browned and crispy.)"
            ]
        },
        {
            "name": "Sticky spiced red cabbage",
            "url": "https://www.bbcgoodfood.com/recipes/8817/sticky-spiced-red-cabbage",
            "author": "Barney Desmazery",
            "ingredients": [
                "1 tbsp olive oil",
                "1 medium-size red cabbage, quartered, cored and shredded",
                "1 finger-size piece fresh root ginger, finely chopped",
                "2 onions, sliced",
                "1 tsp ground allspice",
                "1 tbsp mustard seed",
                "100g golden caster sugar",
                "150ml red wine vinegar"
            ],
            "method": [
                "Heat oil in a large saucepan, add cabbage, ginger, onions, allspice and mustard seeds, then cook for 5 mins until just starting to wilt.",
                "Scatter over the sugar and pour in the vinegar. Cover pan, gently cook for 10 mins, then remove lid and turn up the heat to medium. Simmer the liquid in the cabbage for about 20 mins, stirring occasionally, then stir continuously for the last few mins until all the liquid has evaporated and becomes sticky on the bottom of the pan. Tip cabbage into a large bowl and serve."
            ]
        },
        {
            "name": "Lebkuchen",
            "url": "https://www.bbcgoodfood.com/recipes/1941/lebkuchen",
            "author": "Emma Lewis",
            "ingredients": [
                "250g plain flour",
                "85g ground almond",
                "2 tsp ground ginger",
                "1 tsp ground cinnamon",
                "½ tsp bicarbonate of soda",
                "200ml clear honey",
                "1 lemon, finely grated zest",
                "85g butter",
                "pinch each ground cloves, grated nutmeg and black pepper",
                "1 tsp baking powder",
                "100g icing sugar",
                "1 egg white, beaten"
            ],
            "method": [
                "Tip the dry ingredients into a large bowl. Heat the honey and butter in a pan over a low heat until the butter melts, then pour into the flour mixture along with the lemon zest. Mix well until the dough is combined and fairly solid. Cover and leave to cool.",
                "Heat oven to 180C/fan160C/gas 4. Using your hands, roll dough into about 30 balls, each 3cm wide, then flatten each one slightly into a disk. Divide the biscuits between two baking trays lined with baking parchment, leaving room for them to expand. Bake for 15 mins, then cool on a wire rack.",
                "To ice the biscuits, mix together the icing sugar, egg white and 1-2 tbsp water to form a smooth, runny icing. Dip the top of each biscuit in the icing and spread with the back of a knife. Leave to dry out in a warm"
            ]
        },
        {
            "name": "Fragrant mango & apple chutney",
            "url": "https://www.bbcgoodfood.com/recipes/4859/fragrant-mango-and-apple-chutney",
            "author": "Sara Buenfeld",
            "ingredients": [
                "3 1⁄4 large ripe mangoes, about 1kg/ 2 1⁄4lb",
                "2 tbsp sunflower oil",
                "2 onions, halved and thinly sliced",
                "thumb-sized piece fresh root ginger, peeled and cut into thin shreds",
                "10 green cardamom pods",
                "1 cinnamon stick",
                "½ tsp cumin seed",
                "½ tsp coriander seed, lightly crushed",
                "¼ tsp black onion seeds (Nigella or Kalonji are good)",
                "½ tsp ground turmeric",
                "2 Bramley apples, about 500g/1lb 2oz, peeled, cored and chopped",
                "1 large red chilli, deseeded and finely sliced",
                "375ml white wine vinegar",
                "400g golden caster sugar",
                "1 tsp salt"
            ],
            "method": [
                "Cut each mango in half down the sides of the flat stone that runs through the centre of the fruit, so that you end up with 2 fleshy halves. Now take each mango half and cut into the flesh, making quite chunky diagonal pieces – take care not to cut through the skin. Turn each half inside out, then slice away the chunks of mango that stand proud from the skin. Cut the flesh from around the stones, trim off the skin and chop the flesh.",
                "Heat the oil in a large, deep sauté pan, add the onion and fry for a few mins until starting to soften. Stir in the ginger and cook, stirring frequently, for about 8-10 mins until the onion is golden. Stir in all of the spices, except the turmeric, and fry until toasted.",
                "Stir in the turmeric, add the apple and pour in 500ml water, then cover the pan and cook for 10 mins. Stir in the mango and chilli, then cover and cook for 20 mins more until the apple is pulpy and the mango is tender.",
                "Pour in the vinegar, stir in the sugar and salt, then leave to simmer uncovered for 30 mins, stirring frequently (especially towards the end of the cooking time so that it doesn’t stick) until the mixture is pulpy rather than watery. Spoon into sterilised jars."
            ]
        },
        {
            "name": "Sausage, sage & onion stuffing",
            "url": "https://www.bbcgoodfood.com/recipes/3056/sausage-sage-and-onion-stuffing",
            "author": "Sara Buenfeld",
            "ingredients": [
                "2 onions, sliced",
                "25g butter",
                "1 small Bramley apple, peeled, cored and diced",
                "2 x 400g packs meaty Cumberland sausages, removed from their skins",
                "handful sage, leaves chopped, plus extra for topping",
                "140g granary breadcrumbs"
            ],
            "method": [
                "Fry 2 sliced onions in 25g butter for 5 mins, then add 1 small diced Bramley apple and cook briefly.",
                "Cool, then mix with 800g Cumberland sausages, skins removed, the chopped handful of sage, 140g granary breadcrumbs and seasoning.",
                "Use to stuff the neck end of the bird, then roll any leftovers into balls. Or, pack the whole mixture into a 1kg loaf tin and top with extra sage leaves.",
                "Bake with turkey for 30-40 mins. Drain off any fat and serve sliced."
            ]
        },
        {
            "name": "Chestnut, spinach & blue cheese en croûte",
            "url": "https://www.bbcgoodfood.com/recipes/chestnut-spinach-blue-cheese-en-croute",
            "author": "Sara Buenfeld",
            "ingredients": [
                "50g butter",
                "500g pack leeks, thickly sliced",
                "3 garlic cloves, thinly sliced",
                "240g bag baby spinach",
                "415g can chestnut purée",
                "3 large eggs, plus 1 for glazing",
                "½ nutmeg, finely grated",
                "200g pack vacuum-packed whole cooked chestnuts, halved",
                "85g fresh white breadcrumbs",
                "220g pack blue Shropshire cheese, rind trimmed, diced",
                "500g pack all-butter puff pastry",
                "500ml vegetable stock",
                "2 leeks, thinly sliced",
                "1 tbsp cornflour",
                "300ml pot double cream"
            ],
            "method": [
                "Melt the butter in a large frying pan. Add the leeks and garlic, stir well, cover and cook for 10 mins until the leeks are soft, stirring a few times to check that they don’t catch. Tip into a large bowl. Put the spinach in the pan and allow it to wilt. Leave to cool and, when cold, squeeze out as much liquid from it as you possibly can.",
                "Tip the chestnut purée into the bowl with the leeks and add the 3 eggs, the nutmeg, chestnuts, spinach, breadcrumbs, cheese and seasoning, and stir until well mixed. Chill for at least 1 hr until the mixture firms up.",
                "Heat oven to 220C/200C fan/gas 7. On a lightly floured work surface, roll out the pastry to a rectangle large enough to completely enclose the filling. Carefully lift onto a large, long baking tray that has been lined with baking parchment, then brush round all the edges of the pastry with the remaining egg. Spoon the filling down the centre of the length of the pastry, leaving the ends clear. Tuck the ends over the filling, then firmly lift up the sides to wrap them round, trimming away any excess pastry as you go. Brush with more egg to glaze, then make a few holes in the top so steam can escape as it cooks. Bake for 40 mins until golden and the filling is firm. Remove from the oven, brush with more glaze and bake for 10 mins more.",
                "To make the sauce, heat the stock in a medium pan, add the leeks, boil for 5 mins, then take off the heat and scoop out 2 tbsp of the leeks. Blitz the rest in the pan with the cornflour using a hand blender, then cook, stirring, until thickened. Pour in the cream and reserved leeks and warm through. Can be made 2 days ahead and chilled. Serve the pastry in thick slices with the sauce."
            ]
        },
        {
            "name": "Chestnut, bacon & cranberry stuffing",
            "url": "https://www.bbcgoodfood.com/recipes/3170/chestnut-bacon-and-cranberry-stuffing",
            "author": "Good Food",
            "ingredients": [
                "100g dried cranberries",
                "50ml ruby port",
                "1 small onion, chopped",
                "2 rashers unsmoked back bacon, cut into strips",
                "50g butter",
                "2 garlic cloves, chopped",
                "450g sausagemeat",
                "140g fresh white or brown breadcrumbs",
                "2 tbsp chopped fresh parsley",
                "½ tsp chopped fresh thyme leaves",
                "140g peeled, cooked chestnuts, roughly chopped",
                "1 medium egg, lightly beaten"
            ],
            "method": [
                "Soak the cranberries in the port for an hour. Fry the onion and bacon gently in the butter, until the onion is tender and the bacon is cooked. Add the garlic and fry for another minute or so.",
                "Cool slightly, then mix with all the remaining ingredients, including the cranberries and port, adding enough egg to bind – I find it easiest to use my hands. Fry a knob of stuffing in a little butter, taste and adjust the seasoning if necessary.",
                "To Cook: This stuffing can be baked in a dish, or rolled into balls that will be crisp on the outside and moist inside. To bake, press the stuffing into a greased ovenproof dish in a layer that is around 4cm thick. Bake at 190C/gas 5/fan 170C for about 40 minutes, until browned and, in the case of sausagemeat stuffing, cooked right through. Alternatively, roll into balls that are about 4cm in diameter. Roast the stuffing balls in hot fat (they can be tucked around the turkey or done in a roasting tin of their own) for 30-40 minutes, until crisp and nicely browned on the outside."
            ]
        },
        {
            "name": "Zesty orange marzipan",
            "url": "https://www.bbcgoodfood.com/recipes/4827/zesty-orange-marzipan",
            "author": "Good Food",
            "ingredients": [
                "175g caster sugar",
                "175g icing sugar, plus extra for dusting",
                "250g ground almond",
                "grated zest and juice 1 orange",
                "1 egg",
                "1 egg yolk",
                "shredless marmalade"
            ],
            "method": [
                "Sift the sugars and ground almonds together, then stir through the orange zest. Beat together the egg and egg yolk, then add to the sugar mixture, stirring well.",
                "Knead briefly to ensure the marzipan is completely mixed and pliable, adding a little orange juice if the mix is too dry, or icing sugar if too wet.",
                "Place the cake on a cake board and use small balls of marzipan to plug any holes in the cake. Now glaze the cake with a thin layer of marmalade. Dust your work surface with a little icing sugar, then roll out the marzipan in one direction, keeping the pressure even and turning a ¼ turn every few rolls.",
                "When large enough (about 40cm in diameter for a 20cm cake), roll the marzipan onto the rolling pin and lift onto the cake. Smooth the top with your palms and continue down over the sides of the cake, smoothing out any folds as you go. Trim with a knife where the marzipan meets the board, then leave to dry overnight.",
                " Although homemade marzipan contains raw eggs, the amount of sugar, and lack of moisture, prevents bacteria growing when left at room temperature, so your cake should last for 1-2 months iced. The most important thing is that you don't scrimp on drying time – once you’ve covered your cake in marzipan it should be left to completely dry out for up to 3 days, before you then cover it with icing. If you want to make marzipan before you are ready to cover your cake, then wrap it well in cling film and keep in a fridge for up to a week – as wrapped in a ball it will still contain a little moisture. As it contains raw eggs it shouldn’t be given to anyone in an at-risk group, including pregnant women, the elderly, the unwell and the very young. You can make a cooked marzipan, which carries no risks. It is a little softer, and harder to work with, but a good substitute if you are at all worried."
            ]
        },
        {
            "name": "Sugar-dusted snowflake cake",
            "url": "https://www.bbcgoodfood.com/recipes/889658/sugardusted-snowflake-cake",
            "author": "Sarah Cook",
            "ingredients": [
                "1 x 20cm round or 18cm square Christmas cake(see 'Goes well with', below)",
                "4 tbsp raspberryor apricot jam, warmed and sieved",
                "500g pack marzipan",
                "icing sugar, for dusting",
                "1¼kg pack ready-to-roll white icing",
                "1 egg white, frothed with a fork, or a little thin, runny icing made with icing sugar and water",
                "preserving sugaror granulated sugar",
                "a little edible glitter, if you have it",
                "snowflake-shaped cutters"
            ],
            "method": [
                "Sit the cake on a cake board or flat plate. Brush all over with a little of the jam. Roll out the marzipan on an icing sugar-dusted surface until large enough to cover the sides and top of the cake – use string to help you measure. Cover the cake and trim the excess marzipan from the bottom. Brush with jam again, knead 850g of the white icing until smooth and pliable, then roll out as you did you for the marzipan ensuring it is large enough to cover the top and sides. Lift onto the cake. Smooth the icing down and around the sides, trimming excess from the bottom, as before. Smooth out any marks with the flats of your hand, rubbing the icing to buff it to a shine.",
                "Roll out the rest of the white icing and cut out a few snowflakes. Brush one side with a little egg white or runny icing, then dip this side into the preserving or granulated sugar to coat. Sprinkle on glitter, if using, then use more egg white or icing to stick randomly onto the cake. Leave to set for a few hrs before cutting."
            ]
        },
        {
            "name": "Mini sausage rolls",
            "url": "https://www.bbcgoodfood.com/recipes/12541/mini-sausage-rolls",
            "author": "John Torode",
            "ingredients": [
                "½ small garlic clove",
                "handful parsley, chopped",
                "400g pack sausagemeator sausages",
                "375g pack ready-rolled puff pastry",
                "1 beaten egg, to glaze"
            ],
            "method": [
                "Heat oven to 200C/fan 180C/gas 6.",
                "Crush ½ small garlic clove and a little salt to a paste using a pestle and mortar, or use the flat of your knife on a chopping board. Mix together with a handful of chopped parsley and stir in 50ml cold water.",
                "Place 400g sausagemeat in a food processor (if using sausages, peel away the skins), turn on to a high speed, pour the garlic-flavoured water into the mixture, then season with pepper.",
                "Unroll 375g ready-rolled puff pastry onto a board and cut in half lengthways.",
                "Divide the sausage mixture in two and spread along the length of each pastry strip in a cylinder shape, leaving a 1cm edge.",
                "Tightly roll the pastry around the sausagemeat and brush the ends with 1 beaten egg to secure.",
                "Use a sharp knife to cut each roll into 10 pieces, each about 2.5cm long, and place on a baking sheet.",
                "Can be made up to this point 1 month in advance and frozen. To cook from frozen, simply add 10 mins to cooking time below.",
                "Brush more beaten egg all over the pastry. Place in the oven and cook for 25-35 mins until the pastry is puffed and crisp and the meat has cooked through. Remove and eat hot or cold with tomato ketchup if you like."
            ]
        },
        {
            "name": "Snow globe hot chocolate",
            "url": "https://www.bbcgoodfood.com/recipes/snow-globe-hot-chocolate",
            "author": "Good Food",
            "ingredients": [
                "3 large white marshmallows",
                "icingpens, in black and orange",
                "1 giant chocolate button",
                "1 chocolate- a mini Reese's peanut butter cup or other domed chocolate is perfect",
                "2 tbsp cocoa powder",
                "2 tbsp Horlickspowder",
                "handful mini white marshmallows",
                "1 cookie(small enough to fit in a jam jar)",
                "3 strawberrieslaces",
                "1 cocktail stick",
                "1 large jam jar",
                "ribbonand gift tag"
            ],
            "method": [
                "First make the marshmallow snowman. Skewer the marshmallows together with a cocktail stick - cut off any of the stick that protrudes from the top. Use a little of the icing pen to stick a chocolate button and peanut butter cup to the top of each marshmallow stack, then draw on a face and 3 dots for buttons. Plait 3 strawberry laces and tie around the neck for a scarf. Stick the snowman to a cookie with a little more icing, then set aside to dry for a few mins.",
                "Mix the cocoa and Horlicks together in the bottom of your jar. Put the snowman on top, then scatter around the mini marshmallows. Screw on the lid, tie with a ribbon and a gift tag with the following instructions: Warm 300ml milk in a pan. Remove the snowman from the jar and add the milk. Stir until smooth and chocolatey, then enjoy, with your marshmallow snowman for dunking."
            ]
        },
        {
            "name": "Stollen mince pies",
            "url": "https://www.bbcgoodfood.com/recipes/2760971/stollen-mince-pies",
            "author": "Good Food",
            "ingredients": [
                "375g pack sweet shortcrust pastry",
                "a little flour, for dusting",
                "375g mincemeat",
                "50g madeira cake",
                "50g ground almond",
                "25g caster sugar",
                "50g butter, softened",
                "1 egg yolk",
                "3 tbsp candied peel",
                "100g marzipan, finely diced",
                "25g toasted flaked almond",
                "icing sugar, for dusting"
            ],
            "method": [
                "Roll out the pastry on a lightly floured surface and stamp out 12 roughly 8cm circles – you might need to re-roll the trimmings. Press into the holes of a 12-hole bun tin. Add a few tsp of the mincemeat to each pastry case.",
                "Whizz the cake, ground almonds, caster sugar, butter and egg in a food processor until smooth. Transfer to a bowl, then stir in the candied peel and marzipan. Divide between the tarts and scatter over the flaked almonds. You can cover and chill the unbaked tarts for up to a day, or freeze for up to 3 months.",
                "Heat oven to 200C/180C fan/gas 6. Bake the pies for 20-25 mins until golden. Remove from the oven and dust with icing sugar. When cool enough, lift from the tin."
            ]
        },
        {
            "name": "Macadamia & cranberry American cookies",
            "url": "https://www.bbcgoodfood.com/recipes/13387/macadamia-and-cranberry-american-cookies",
            "author": "Sara Buenfeld",
            "ingredients": [
                "3 x 200g/7oz white chocolatebars, chopped",
                "200g butter",
                "2 eggs",
                "100g light muscovado sugar",
                "175g golden caster sugar",
                "2 tsp vanilla extract",
                "350g plain flour",
                "2 tsp baking powder",
                "1 tsp cinnamon",
                "100g dried cranberry",
                "100g macadamia nut, chopped"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4. Melt 170g of the chocolate, then allow to cool. Beat in the butter, eggs, sugars and vanilla, preferably with an electric hand whisk, until creamy. Stir in the flour, baking powder, cinnamon and cranberries with two-thirds of the remaining chocolate and macadamias, to make a stiff dough.",
                "Using a tablespoon measure or a small ice-cream scoop, drop small mounds onto a large baking dish, spacing them well apart, then poke in the reserved chocolate, nuts and berries. Bake in batches for 12 mins until pale golden, leave to harden for 1-2 mins, then cool on a wire rack.",
                "To freeze, open-freeze the raw cookie dough scoops on baking trays; when solid, pack them into a freezer container, interleaving the layers with baking parchment. Use within 3 months. Bake from frozen for 15-20 mins."
            ]
        },
        {
            "name": "Chocolate orange & cranberry red velvet bombe",
            "url": "https://www.bbcgoodfood.com/recipes/chocolate-orange-cranberry-red-velvet-bombe",
            "author": "Cassie Best",
            "ingredients": [
                "175g butter, very soft, plus extra for greasing",
                "200g plain flour, plus extra for dusting",
                "200g golden caster sugar",
                "4 large eggs",
                "2 tbsp cocoa",
                "1 tsp bicarbonate of soda",
                "1½ tsp baking powder",
                "75g buttermilk",
                "2 tsp vanilla extract",
                "2 x 10g tubes red food colouring(make sure it’s a bake-safe variety – we used Dr. Oetker)",
                "2 tbsp white wine vinegar",
                "450ml double cream",
                "zest 2 oranges",
                "100g bar white chocolate, finely chopped",
                "100g bar dark chocolate, finely chopped",
                "200g bar milk chocolate, finely chopped",
                "180g tub cream cheese",
                "3 tbsp icing sugar",
                "50g dried cranberries, plus extra to serve",
                "sprinklesand edible glitter (optional), to decorate"
            ],
            "method": [
                "Heat oven to 160C/140C fan/gas 3. Grease 2 x 16cm hemisphere cake tins, then dust with flour and shake out the excess. Stand the tins on two ramekins placed on a baking tray to hold them steady. Put the cake ingredients in a large mixing bowl, add a pinch of salt and whisk together until smooth and evenly coloured bright red. Divide the mixture between the two tins and bake for 45 mins. Remove from the oven, cool in the tins for 10 mins, then tip onto a wire rack and leave until completely cold.",
                "Meanwhile, make the chocolate-orange ganache and the filling. Pour the cream into a saucepan, add the orange zest and heat until just steaming. Put half the white chocolate in a bowl, and the dark and milk chocolates in another bowl. Pour 50ml of the hot cream over the white chocolate (strain it if the orange zest is in big strands), and the remaining cream over the dark and milk mixture. Leave the bowls for 1-2 mins, then stir until smooth and glossy. Set aside to cool for 10 mins.",
                "Put the cream cheese in a bowl and whisk lightly to loosen. Add the icing sugar and the cooled white chocolate and cream mixture, then blend until smooth. Stir through the cranberries, then chill.",
                "When the cakes are cold, you can start assembling. With the cakes flat-side up, use a 7cm biscuit cutter to mark a circle in the centre of each. Use a spoon to gently scoop a dip in each cake, about 4cm deep (save the crumbs for cake truffles – see tip, left.) Remove the cream cheese mixture from the fridge and use to fill the cavities in the cakes, spreading a little onto the flat surfaces too, to help them stick together. Invert 1 cake onto the other to create a sphere, and place on a wire rack set over a baking tray (this will catch any chocolate drips).",
                "To ice the cake, the chocolate ganache needs to be the right consistency – pourable but not too runny. If it has set a little too much, place in the microwave for 10-20 secs, then mix until smooth; if it is too runny, chill until it has firmed up a little. Pour half the ganache over the cake, letting it cover the sides and run into the tray below (use the chocolate drips for cake truffles, see Tip). Cover the whole surface using a palette knife. This is just the first coating, so won’t fill the gap between the sponges. Chill the cake for 20 mins or until the ganache has firmed up a little.",
                "Remove the cake from the fridge. Cover the gap around the middle with the remaining ganache, smoothing it all over with a palette knife. Return to the fridge for another 20 mins until firm, then transfer to a serving plate.",
                "Melt the remaining white chocolate in the microwave in short 10-sec bursts. Drizzle over the top of the cake, then scatter with dried cranberries, sprinkles and edible glitter, if you like. Chill if not serving straight away – it will keep in the fridge for up to 2 days. Remove from the fridge 30 mins before serving."
            ]
        },
        {
            "name": "Persian cranberry sauce",
            "url": "https://www.bbcgoodfood.com/recipes/persian-cranberry-sauce",
            "author": "Good Food",
            "ingredients": [
                "250g fresh or frozen cranberries",
                "2 tbsp pomegranate molassesor balsamic vinegar",
                "juice and finely grated zest ½ orange, plus extra zest to serve",
                "2 tbsp golden caster sugar, plus extra to taste",
                "pinch of ground allspice"
            ],
            "method": [
                "Tip all the ingredients into a small saucepan and bring to a gentle simmer. Stir over a low heat for 10 mins until the cranberries have burst into a thick, glossy, sticky sauce. We like ours on the sour side to give your plate a hit of acidity, but if you prefer it sweeter add a bit more sugar. Leave the sauce to cool, then sprinkle over a little orange zest to serve. Can be kept covered in the fridge for up to a week, or frozen for 4 months."
            ]
        },
        {
            "name": "Chocolate mint loaf cake",
            "url": "https://www.bbcgoodfood.com/recipes/chocolate-mint-loaf-cake",
            "author": "Sarah Cook",
            "ingredients": [
                "2 x 85g salted butter, plus extra for greasing",
                "2 x 50g dark chocolate, broken into pieces",
                "2 x 120g plain flour",
                "2 x 140 golden caster sugar",
                "6 tbsp cocoa",
                "1 tsp bicarbonate of soda",
                "2 large eggs",
                "284ml carton buttermilk",
                "300g box After Eights, broken",
                "50ml double cream",
                "turquoise food colouring",
                "300g Regal-Ice Ready to Roll icing",
                "1 tsp peppermintextract"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4. Grease and line the base and sides of a 22cm square tin. Melt 85g butter and 50g chocolate together in a small pan. Mix 120g flour, 140g sugar, 3 tbsp of the cocoa and ½ tsp bicarbonate in a bowl.",
                "Whisk together 1 egg with half the buttermilk (about 140ml). Scrape the melted chocolate mixture and egg mixture into the dry ingredients, along with 100ml boiling water. Whizz briefly with an electric whisk until lump-free. Scrape into the tin and bake for 18-20 mins until a skewer comes out clean.",
                "Cool the cake in the tin for 15 mins, then transfer to a wire rack to finish cooling while you repeat steps 1 and 2 to make a second cake. Cool both completely.",
                "To make the icing, melt the After Eights and cream together in a saucepan. Cool, then chill until spreadable.",
                "Trim the cake edges, then halve to make 4 rectangles. Use half of the icing to sandwich the layers together, then spread the rest over the top and sides. Chill.",
                "Knead some colouring into the ready-to-roll icing with the peppermint extract. Roll out on an icing sugar dusted surface, then lift over to cover the cake, smoothing with your hands. Trim excess icing, then scatter with decorations.",
                "Chill again for 1 hr to firm up, then serve or keep in the fridge, removing 30 mins before serving."
            ]
        },
        {
            "name": "Chestnut stuffing roll",
            "url": "https://www.bbcgoodfood.com/recipes/2744665/chestnut-stuffing-roll",
            "author": "Good Food",
            "ingredients": [
                "1 tbsp butter",
                "3 onions, chopped",
                "15g pack sage, shredded",
                "200g pack cooked chestnut",
                "100g hazelnut",
                "100g breadcrumb",
                "½ tsp mace",
                "2 large eggs, beaten",
                "2 tbsp butter, plus extra to serve",
                "15 rashers streaky bacon",
                "few sageleaves, to serve (optional)"
            ],
            "method": [
                "To make the stuffing, melt the butter in a large non-stick pan, add the onions and gently cook for 10-15 mins until very soft. Stir in the sage for 1 min, then tip into a large mixing bowl. Pulse the chestnuts in a food processor until chopped into small bits, then tip these into the bowl with the onions and repeat with the hazelnuts. Add the breadcrumbs, mace, beaten egg, 1 tsp salt and some pepper, and mix everything together well.",
                "Tear off a very large sheet of foil. Smear the butter in the middle, making a rectangle about 30 x 40cm. Lay the bacon rashers over in a row, overlapping a little. Use a rolling pin to slowly but firmly roll down the length of the bacon strips to stretch them a bit. Shape the stuffing into a log along the rashers. Using the foil to help you, roll up the stuffing so that it is completely wrapped in the bacon. Overwrap with the extra foil and twist the ends to tighten and seal. If it’s not very round, give it an extra roll or two on your work surface. Chill until ready to roast. ",
                ".",
                "To cook, bake at 200C/180C fan/gas 6 (when you turn up the heat for the turkey) for 30 mins. When the turkey comes out, turn up the heat to 220C/200C fan/gas 7, unwrap the stuffing and continue to cook for 30 mins more until crisp. Keep warm, then slice and serve with sage leaves fried in butter, if you like."
            ]
        },
        {
            "name": "Melty cheese fondue pot",
            "url": "https://www.bbcgoodfood.com/recipes/melty-cheese-fondue-pot",
            "author": "Cassie Best",
            "ingredients": [
                "200g brie, rind removed, roughly chopped",
                "100g cream cheese(not light versions)",
                "100g gruyère, rind removed, grated",
                "2 tbsp grated parmesan(or vegetarian alternative)",
                "2 tbsp milk",
                "2 tsp cornflour",
                "few thyme sprigs, leaves picked and roughly chopped",
                "100g caramelised onion chutney",
                "crusty bread, to serve"
            ],
            "method": [
                "Put the brie, cream cheese, gruyère, half the parmesan, the milk and cornflour into a food processor, and blitz until smooth. Stir through the thyme and a little black pepper. Spoon the chutney into an ovenproof baking dish (ours was 15cm round) and spread it over the base. Top with the cheese mixture, spread to cover the chutney, then scatter over the remaining parmesan. It can now be covered with cling film and chilled for up to 3 days.",
                "Heat oven to 160C/140C fan/gas 3. Put the baking dish on a baking tray and cook for 25 mins until bubbling. Turn the grill to a medium-high setting and grill for 2-3 mins or until golden brown and crispy on top. Remove from the oven and leave to cool for 5 mins before serving with crusty bread for dunking."
            ]
        },
        {
            "name": "Chorizo jam",
            "url": "https://www.bbcgoodfood.com/recipes/chorizo-jam",
            "author": "Good Food",
            "ingredients": [
                "500g cooking chorizo, diced",
                "1 large white onion, finely sliced",
                "2 garlic cloves, crushed",
                "85g light muscovado sugar",
                "3 tbsp Sherry or red wine vinegar",
                "2 tbsp maple syrup",
                "1 shot of espressocoffee or 100ml/4fl oz strong black coffee"
            ],
            "method": [
                "Fry the chorizo in a large saucepan for about 5 mins until golden and crispy at the edges. Remove the chorizo with a slotted spoon and transfer to a plate, leaving the oil that has been released in the pan.",
                "Turn the heat down low and gently cook the onion in the chorizo oil for 15-20 mins or until very soft and starting to brown. Stir in the garlic, muscovado sugar, Sherry, maple syrup, espresso and chorizo.",
                "Cook slowly for 35-40 mins, stirring occasionally, until thick and syrupy. Turn off the heat, leave to cool a little, then tip everything into a food processor. Pulse briefly to chop everything up into really small pieces, then leave the mixture to cool before packing it into 2 sterilised jam jars. Will keep for up to 1 month in the fridge."
            ]
        },
        {
            "name": "Parsnip, cranberry & chestnut loaf",
            "url": "https://www.bbcgoodfood.com/recipes/69605/parsnip-cranberry-and-chestnut-loaf",
            "author": "Sarah Cook",
            "ingredients": [
                "4 tbsp butter, plus a little extra for greasing",
                "3 onions, chopped",
                "15g pack sage, 6 leaves reserved, rest shredded",
                "200g pack cooked chestnut",
                "100g walnut",
                "100g breadcrumb",
                "½ tsp mace",
                "1 egg, beaten",
                "500g cranberry",
                "175g caster sugar",
                "550g parsnip, choose long, thin ones if you can, peeled then halved lengthways",
                "1 tbsp honey"
            ],
            "method": [
                "Melt 1 tbsp butter in a large non-stick pan, add the onions and gently cook for 10-15 mins until very soft. Stir in the sage for 1 min, then tip into a large mixing bowl. Pulse the chestnuts in a food processor until chopped into small bits, then tip these into the bowl with the onions and repeat with the walnuts. Now add the breadcrumbs, mace, beaten egg, 1 tsp salt and some pepper and mix everything together well.",
                "Tip the cranberries and sugar into a pan and simmer for about 8-10 mins over a high heat. The sugar will melt and cranberries will pop and become saucy – keep bubbling until sticky. Set aside to cool. Grease a 900g loaf tin, line with a long strip of baking parchment that covers the bottom and two ends, then grease this as well.",
                "Bring a large pan of salted water to the boil. Throw in the parsnips and boil for 3½ mins. Drain well. From the thinner ends, cut off lengths of parsnip that fit widthways across the bottom of your loaf tin. Keep going until you have enough to snugly line the base of the tin. Roughly chop all leftover parsnip and mix into the nut mixture.",
                "Heat oven to 180C/160C fan/gas 4. Mix the parsnip lengths with 1 more tbsp butter and the honey to coat, then fit them into the tin. Top with ¹/³ of the nut mixture – pack it down well and smooth the surface. Spread ¹/³ of the cranberry sauce on top, leaving a small gap around the edges. Top with the remaining nut mixture and pack down as before. The loaf can be made up to 24 hrs ahead, then covered and chilled, before continuing. Cover with foil then bake for 1 hr.",
                "To serve, melt the remaining 2 tbsp butter in a small pan and sizzle the reserved sage leaves for a minute. Splash water into the remaining cooked cranberries until saucy. Loosen around the sides of the loaf with a round-bladed knife if you need, then turn out. Drizzle with the sage butter and leaves. Serve in slices with extra cranberry sauce."
            ]
        },
        {
            "name": "Mulling syrup",
            "url": "https://www.bbcgoodfood.com/recipes/851643/mulling-syrup",
            "author": "Lulu Grimes",
            "ingredients": [
                "250g caster or granulated sugar",
                "2 oranges, halved",
                "6 whole cloves",
                "6 whole allspice",
                "2 cinnamon sticks",
                "¼ nutmeg, freshly grated",
                "small piece ginger, sliced"
            ],
            "method": [
                "Put all the ingredients into a saucepan with 1 litre water and bring slowly to a simmer, making sure all the sugar has been completely dissolved. Turn down the heat and simmer for 20 mins. Leave to cool, then strain through a very fine sieve.",
                "Sterilise your bottles by washing them in hot soapy water, rinsing well, then drying them in a warm oven. Meanwhile, rewarm the syrup until just hot, then pour into the bottles while still hot and seal.",
                "Before giving away, add labels with serving instructions: "
            ]
        },
        {
            "name": "Cranberry & cream cheese muffins",
            "url": "https://www.bbcgoodfood.com/recipes/997636/cranberry-and-cream-cheese-muffins",
            "author": "Good Food",
            "ingredients": [
                "100g soft cheese",
                "250g caster sugar",
                "175g cranberries",
                "200g plain flour",
                "2 tsp baking powder",
                "2 eggs",
                "75ml flavourless oil, such as sunflower",
                "1 tsp vanilla extract"
            ],
            "method": [
                "Heat oven to 190C/170C fan/gas 5. Line a 12-hole muffin tin with muffin cases. Beat the soft cheese with 25g of the sugar and chill until needed. Heat the cranberries together with another 25g of sugar until they start to pop. Mash lightly and cool.",
                "Sift the flour into a large bowl and add the remaining sugar, baking powder and a pinch of salt. Add the eggs, oil, vanilla and cranberry mixture, and stir together. Don’t worry if the mix looks a bit lumpy. Divide it between the cases, they should look about two-thirds full. Make a small dip in the centre of each and put a blob of soft cheese in. Bake for 25 mins or until risen and golden. Cool on a wire rack."
            ]
        },
        {
            "name": "St Lucia saffron buns",
            "url": "https://www.bbcgoodfood.com/recipes/st-lucia-saffron-buns",
            "author": "Edd Kimber",
            "ingredients": [
                "300ml whole milk",
                "½ g pack saffron",
                "75g unsalted butter, cut into cubes",
                "500g strong white bread flour",
                "100g golden caster sugar",
                "7g sachet fast-action yeast",
                "1 large egg, beaten, plus extra for egg wash",
                "a little oil, for greasing",
                "24 currants"
            ],
            "method": [
                "Put the milk in a small pan and gently heat until it’s steaming. Use a pestle and mortar to grind the saffron into a powder. Add this to the pan of milk along with the butter. Swirl to melt the butter, then set aside until lukewarm.",
                "In a large bowl, mix the flour, caster sugar, 1 tsp salt and the yeast together, and make a well in the middle of the bowl. Pour in the milk mixture along with the egg. Mix together to form a sticky dough, then turn out onto the work surface and knead until smooth and elastic (this will take about 10 mins). Put the dough into a lightly oiled bowl and cover with oiled cling film. Set the bowl in a warm part of the house and allow to rise for about 1 hr until doubled in size.",
                "Knock back the dough and divide into 12 equal portions. Cover the pieces with the oiled cling film while you make the rolls – this will stop the dough from drying out. Working with 1 piece of dough at a time, roll out into a 30cm-long strand. Roll up one end into the middle, turn over and roll the other end into the middle, forming the dough into an S-shape. Place the buns on a large (or 2 smaller) parchment-lined baking tray. Once all the buns are made, lightly cover with oiled cling film and prove until almost doubled in size (if making ahead, keep the dough in the fridge overnight and bake in the morning). While the buns prove, heat oven to 200C/180C fan/gas 6.",
                "When ready to bake, brush the buns with beaten egg and press a currant into the centre of each spiral. Put the trays in the oven and bake for around 15 mins. Allow to cool before serving. These are best eaten on the day they are made but will keep for a couple of days."
            ]
        },
        {
            "name": "Pineapple & ginger Pavlova",
            "url": "https://www.bbcgoodfood.com/recipes/pineapple-ginger-pavlova",
            "author": "Katy Greenwood",
            "ingredients": [
                "4 large egg whites",
                "225g white caster sugar",
                "1 tsp ground ginger",
                "1 tsp cornflour",
                "1 tsp white wine vinegar",
                "½ large pineapple, peeled, cored and cut into 4-5 wedges",
                "3 tbsp ginger syrupfrom the jar (see below), plus extra to drizzle",
                "6 balls stem gingerin syrup, roughly chopped",
                "500ml double cream",
                "1 tbsp icing sugar, plus extra for dusting handful mint leaves, shredded"
            ],
            "method": [
                "Heat oven to 150C/130C fan/gas 2. Place the egg whites in a large very clean bowl, and whisk to stiff peaks with an electric hand whisk. Continue to whisk while you add the sugar, 1 tbsp at a time, until the mixture is thick and glossy. Continue to whisk as you add the ginger, cornflour and vinegar.",
                "Draw a 23cm circle on a piece of baking parchment, then turn it over and place on a large baking tray. Spread out the meringue mixture to fill the circle, creating a dip in the middle and higher sides. Run a palette knife up the edges at regular intervals if you want to create ridges. Bake for 1 hr, then leave in the oven with the door shut for 8 hrs until the Pavlova is completely cool.",
                "While the Pavlova bakes, heat a clean griddle pan over a medium-high heat until hot. Brush the pineapple wedges with the ginger syrup and griddle for 2 mins until char lines appear and the pineapple is slightly softened. Leave to cool completely, then cut into chunks. (The pineapple can be griddled the day before and chilled. Let it come to room temperature before you assemble the Pavlova. The Pavlova base can be made up to 2 days before serving, stored in an airtight container, then topped with cream and pineapple just before serving).",
                "When you’re ready to serve, whizz the stem ginger and 2 tbsp of the syrup in the small bowl of a food processor to a chunky paste. Add the cream and icing sugar and whip to soft peaks, then spoon into the crater of the meringue. Top with the pineapple, drizzle with a little extra ginger syrup, scatter over the mint and dust with icing sugar."
            ]
        },
        {
            "name": "Sweet potato & butternut squash soup with lemon & garlic toast",
            "url": "https://www.bbcgoodfood.com/recipes/sweet-potato-butternut-squash-soup-lemon-garlic-toast",
            "author": "James Martin",
            "ingredients": [
                "500g sweet potatoes, peeled and diced",
                "1 butternut squash, peeled, deseeded and diced",
                "1 tbsp clear honey",
                "1 tbsp olive oil, plus a drizzle",
                "2 onions, roughly chopped",
                "3 garlic cloves, crushed",
                "1l vegetable or chicken stock",
                "1 tsp cinnamon",
                "1 tsp grated nutmeg",
                "100ml double cream",
                "1 tbsp olive oil",
                "3 garlic cloves, crushed",
                "100g butter, at room temperature",
                "zest 1 lemon",
                "2 tbsp snipped chives",
                "1 tbsp chopped thyme",
                "2 ciabattaloaves, cut into slices"
            ],
            "method": [
                "Heat oven to 220C/200C fan/gas 7. Put the sweet potato and butternut squash on a baking tray and add the honey and a drizzle of olive oil. Roast for 40-45 mins until soft and starting to caramelise at the edges, stirring occasionally.",
                "Meanwhile, fry the onions in 1 tbsp olive oil until soft, then add the garlic, chicken stock, cinnamon and nutmeg. Bring to the boil, and simmer for 5 mins.",
                "Remove the sweet potatoes and butternut squash from the oven and add to the pan with the stock. Blend everything until smooth using a stick blender. Stir in most of the cream and bring back to a gentle simmer, and season with salt and pepper to taste.",
                "To make the lemon & garlic toasts, gently warm the olive oil and garlic in a pan over a low heat for a few mins; the garlic should be softened but not browned. Remove from the heat and mix in the butter and lemon zest until smooth. Leave to cool, then stir in the chives and thyme.",
                "Toast the ciabatta slices, and top each with a spoonful of garlic butter. Serve with the soup, drizzled with the remaining cream, and some black pepper."
            ]
        },
        {
            "name": "Ham & cheese croquetas",
            "url": "https://www.bbcgoodfood.com/recipes/ham-cheese-croquetas",
            "author": "Justine Pattison",
            "ingredients": [
                "25g butter",
                "½ small onion, finely chopped",
                "50g plain flour",
                "250ml milk",
                "140g sliced smoked ham, diced",
                "50g mature cheddar, coarsely grated",
                "50g gruyère, finely grated",
                "1 tsp Dijon mustard",
                "2 tbsp double cream",
                "2 large eggs",
                "50g plain flour",
                "140g fine dried breadcrumbs",
                "sunflower oil, for deep frying",
                "300g ripe tomatoes, roughly chopped",
                "1 long red chilli, finely chopped (deseeded if you don't like it too hot)",
                "1 small red onion, finely chopped",
                "4 large garlic cloves, crushed",
                "100g demerara sugar",
                "100ml red wine vinegar"
            ],
            "method": [
                "To make the croquetas, melt the butter in a medium saucepan and gently fry the onion for 3 mins or until lightly coloured. Stir in the flour and cook for 30 secs. Gradually add the milk, stirring constantly, and cook over a low heat for 5 mins until thick and glossy. Stir in the ham, cheese, mustard and cream, and season to taste. Cook for 1 min more until the cheese melts, stirring constantly.",
                "Pour into a bowl and cover the surface with cling film to stop a skin forming. Leave to cool, then chill for 4 hrs or overnight - the mixture needs to be very stiff to form the croquetas. Take heaped teaspoons of the mixture and, with wet hands, roll into 24 small oval shapes and put on a tray. Beat the eggs in a shallow bowl, put the flour on a plate and half of the breadcrumbs in a bowl.",
                "Roll each of the croquetas lightly in flour, then in egg before coating in breadcrumbs. Place on a baking tray lined with baking parchment. Use the remaining breadcrumbs to top up the bowl halfway through the coating process. Chill for 30 mins (or to freeze, see tip, below left).",
                "Meanwhile, make the tomato chilli jam. Put all the ingredients in a large saucepan and bring to a gentle simmer. Cover loosely with a lit and cook for 50 mins - 1 hr, stirring occasionally, until thick and glossy. Leave to cool before serving.",
                "Fill a large saucepan one-third full with the sunflower oil and heat to 180C (or heat the oil in an electric deep-fat fryer). Do not overheat and do not leave hot oil unattended. Using a metal slotted spoon, lower 6 croquets into the oil and cook for 1.5 mins or until golden brown. Transfer to a baking tray lined with kitchen paper to absorb excess oil, and continue cooking the rest. Serve with the chilli jam for dipping."
            ]
        },
        {
            "name": "Spicy tree biscuits",
            "url": "https://www.bbcgoodfood.com/recipes/147612/spicy-tree-biscuits",
            "author": "Mary Cadogan",
            "ingredients": [
                "175g dark muscovado sugar",
                "85g golden syrup",
                "100g butter",
                "3 tsp ground ginger",
                "1 tsp ground cinnamon",
                "350g plain flour, plus extra for dusting",
                "1 tsp bicarbonate of soda",
                "1 egg, lightly beaten",
                "100g white chocolate",
                "edible silver balls"
            ],
            "method": [
                "Heat the sugar, golden syrup and butter until melted. Mix the spices and flour in a large bowl. Dissolve the bicarbonate of soda in 1 tsp cold water. Make a well in the centre of the dry ingredients, add the melted sugar mix, egg and bicarbonate of soda. Mix well. At this stage the mix will be soft but will firm up on cooling.",
                "Cover the surface of the biscuit mix with cling film and leave to cool, then put in the fridge for at least 1 hr to become firm enough to roll out.",
                "Heat oven to 190C/170C fan/gas 5. Turn the dough out onto a lightly floured surface and knead briefly. (At this stage the dough can be put into a food bag and kept in the fridge for up to a week.) Cut the dough in half. Thinly roll out one half on a lightly floured surface. Cut into shapes with cutters, such as gifts, trees and hearts, then transfer to baking sheets, leaving a little room for them to spread. If you plan to hang the biscuits up, make a small hole in the top of each one using a skewer. Repeat with remaining dough.",
                "Bake for 12-15 mins until they darken slightly. If the holes you have made have closed up, remake them while the biscuits are warm and soft using a skewer. Cool for a few mins on the baking sheets, then transfer to a wire rack to cool and harden up completely.",
                "Break up the chocolate and melt in the microwave on Medium for 1-2 mins, or in a small heatproof bowl over simmering water. Drizzle the chocolate over the biscuits, or pipe on shapes or names, then stick a few silver balls into the chocolate. If hung up on the tree, the biscuits will be edible for about a week, but will last a lot longer as decorations."
            ]
        },
        {
            "name": "Black Forest trifle",
            "url": "https://www.bbcgoodfood.com/recipes/893662/black-forest-trifle",
            "author": "Good Food",
            "ingredients": [
                "500ml tub ready-made chilled custard– look for one with real vanilla seeds",
                "100g plain chocolate, broken into pieces",
                "400g chocolatebrownies",
                "2 x 390g jars cherriesin kirsch or similar",
                "300g tub double cream",
                "200ml tub crème fraîche",
                "25g icing sugar",
                "grated chocolate, to decorate, and fresh cherries (optional)"
            ],
            "method": [
                "Put the custard into a pan with the chocolate pieces. Gently heat, stirring, until the chocolate has melted into the custard. Cover with cling film and cool.",
                "Arrange the brownies in the base of a trifle bowl. Drain the jars of cherries, reserving the liquid, and scatter over the brownies. Drizzle over 100ml reserved liquid. Spoon the cooled chocolate custard over and chill while you make the topping.",
                "Lightly whip the cream with the crème fraîche and icing sugar until soft peaks form. Chill until ready to serve, then pile on top of the trifle and decorate with grated chocolate and fresh cherries, if you like."
            ]
        },
        {
            "name": "Corn cups with prawns, mango & chillies",
            "url": "https://www.bbcgoodfood.com/recipes/corn-cups-prawns-mango-chillies",
            "author": "Jennifer Joyce",
            "ingredients": [
                "8-10 corn tortillas",
                "3 tbsp vegetable oil",
                "100g small shelled prawns",
                "juice 1 lime",
                "½ mango, peeled, deseeded and finely diced",
                "2 tbsp finely diced red onion",
                "1 red chilli, finely diced",
                "handful coriander, finely chopped and some whole leaves reserved"
            ],
            "method": [
                "Heat oven to 200C/180C fan/gas 6. Using a 6cm pastry cutter, cut out circles from the tortillas. Heat the tortilla circles from the tortillas. Heat the tortilla circles for 5 secs in a microwave, then press into a mini muffin tin. Brush with the oil and bake for 8-10 mins until golden and crisp. Remove and leave to cool completely.",
                "Chop the prawns into small pieces and marinate in the lime juice for 5 mins. Put the prawns and lime juice in a bowl with the mango, red onion, chilli and coriander. Season, mix together and use to fill the corn cups just before serving. Top with coriander leaves."
            ]
        },
        {
            "name": "Chestnut, bacon & parsnip soup",
            "url": "https://www.bbcgoodfood.com/recipes/chestnut-bacon-parsnip-soup",
            "author": "Cassie Best",
            "ingredients": [
                "4 chopped rashers smoked streaky bacon",
                "drizzle of olive or rapeseed oil",
                "1 chopped onion",
                "1 crushed garlic clove",
                "6 peeled and chopped parsnips",
                "1 chicken stock cube",
                "400ml milk",
                "leaves from 4 thyme sprigs",
                "200g cooked, chopped chestnuts"
            ],
            "method": [
                "Fry the rashers of bacon in the oil until crisp. Scoop out half the bacon and set aside until later. Add the onion and garlic to the pan, stirring until tender, then add the parsnips. Cook for another 5 mins, then crumble in the chicken stock cube. Add the milk, 600ml water, the thyme and chestnuts. Cover and simmer for 30 mins until the parsnip is tender. Blitz with a hand blender, then season to taste. Ladle into bowls and top with the reserved bacon."
            ]
        },
        {
            "name": "Crispy traybake stuffing",
            "url": "https://www.bbcgoodfood.com/recipes/crispy-traybake-stuffing",
            "author": "Chelsie Collins",
            "ingredients": [
                "2 tbsp butter",
                "2 onions, halved and sliced",
                "1 Bramley apple, peeled, cored and diced",
                "2 x 400g packs Cumberland sausages, skins removed",
                "small pack sage leaves, chopped, a few whole leaves reserved to serve",
                "100g breadcrumbs",
                "100g cooked chestnuts, roughly chopped"
            ],
            "method": [
                "Heat the butter in a large, non-stick pan over a medium heat and cook the onions for 10 mins until softened. Add the apple, cook for 2-3 mins more, then set aside.",
                "Tip the sausagemeat into a large bowl, and combine with the onion and apple mixture, all the other ingredients and some seasoning. Use your hands to mix everything really well. Can be kept in the fridge up to two days before baking.",
                "While the turkey crown is resting, spread the stuffing into a large shallow roasting tin and cook in the oven with the turkey legs for 30-35 mins until the top has formed a crust. Serve immediately with the reserved sage leaves scattered over."
            ]
        },
        {
            "name": "Marzipan-in-the-middle bundt cake",
            "url": "https://www.bbcgoodfood.com/recipes/marzipan-middle-bundt-cake",
            "author": "Jane Hornby",
            "ingredients": [
                "225g unsalted butter, softened, plus extra for greasing",
                "225g self-raising flour, plus 1 tbsp extra for the tin",
                "250g dark muscovado sugar",
                "4 large eggs, at room temperature, beaten",
                "1 tsp baking powder",
                "100g pack ground almonds",
                "1 tsp mixed spice",
                "1 tsp ground cinnamon, plus a pinch extra to decorate",
                "250g grated butternut squash",
                "250g mixed dried fruit",
                "100g pack walnut pieces, chopped, reserving a few whole to decorate",
                "flour, for dusting",
                "200g marzipan",
                "50g glacé cherries, roughly chopped, plus a few whole cherries to decorate",
                "zest 1 orange",
                "140g full-fat cream cheese, chilled",
                "175g icing sugar, sifted",
                "50g unsalted butter, softened",
                "2 tsp whole milk",
                "1 tsp vanilla extract"
            ],
            "method": [
                "Lightly and evenly grease a 25cm bundt tin with soft butter, making sure you get well into any flutes or ridges. Sift 1 tbsp flour over the tin, then tilt and turn the tin until the inside is completely covered with a very thin layer of flour. Tap to gather any excess at the bottom a few times as you go. Once the butter is coated, tap and tip out the excess flour. Heat oven to 180C/160C fan/gas 4.",
                "For the marzipan middle, dust the work surface with a little more flour, knead the marzipan briefly, then work in the cherries and orange zest. Roll into a sausage about 3cm thick, then press the ends together to make a ring.",
                "To make the cake, put the butter, flour, sugar, eggs, baking powder, almonds, spices and 1/4 tsp salt in a large bowl. Use an electric whisk to mix until smooth, then fold in the squash, fruit and walnuts.",
                "Spoon half the batter into the prepared tin, then press the ring of marzipan on top. Cover with the rest of the batter and smooth the top. Bake for 30 mins then – without opening the oven – reduce to 160C/140C fan/gas 3 and bake for another 30 mins. The cake will be risen, golden and shrunk away from the sides when it’s ready. Cool in the tin for 15 mins, then give the tin a sharp tap on the bottom before turning the cake out onto a cooling rack.",
                "To make the frosting, beat together half the cream cheese with the icing sugar and butter until evenly blended. When smooth, beat in the remaining cream cheese along with the milk and vanilla to make a thick, but still flowing, frosting – it should have a consistency similar to semi-whipped cream.",
                "When the cake is cold, spoon over the frosting, letting it drip down the sides. Sprinkle with a little cinnamon, then chill for 10 mins to set the frosting a little. Decorate with whole cherries and walnuts. Keep in the fridge and eat within 5 days."
            ]
        },
        {
            "name": "Spiced braised red cabbage",
            "url": "https://www.bbcgoodfood.com/recipes/spiced-braised-red-cabbage",
            "author": "Jenny White",
            "ingredients": [
                "1 star anise",
                "1 cinnamon stick",
                "5 cardamom pods",
                "1 small red cabbage(about 900g)",
                "1 garlic clove",
                "2 large onions, chopped",
                "1 Bramley apple, peeled, cored and finely chopped",
                "3 tbsp brown sugar",
                "3 tbsp red wine vinegar",
                "25g butter"
            ],
            "method": [
                "Heat oven to 150C/130C fan/gas 2. Put the star anise, cinnamon stick and cardamom pods in the centre of a small square of muslin, and tie the ends together to make a bag. Put the spice bag in a medium flameproof casserole dish.",
                "Remove any wilted or tough outer leaves from the cabbage. Cut it into quarters, then remove and discard the core. Shred the cabbage finely and layer up in the dish with the garlic, onions, apple and brown sugar.",
                "Spoon over the vinegar and dot the top with the butter. Cover with a lid and cook for 21/2-3 hrs, stirring twice during cooking – the cabbage should be tender but not mushy. Remove the spice bag and serve."
            ]
        },
        {
            "name": "Clementine poppy seed loaf",
            "url": "https://www.bbcgoodfood.com/recipes/clementine-poppy-seed-loaf",
            "author": "Sarah Cook",
            "ingredients": [
                "140g butter, softened, plus extra for greasing",
                "50g crème fraîche",
                "200g golden caster sugar",
                "1 tsp orange or vanilla extract",
                "3 large eggs",
                "225g self-raising flour",
                "50g cornflour",
                "2 tbsp poppy seeds, plus extra for sprinkling",
                "4 clementines, zest from 3 and 100ml juice",
                "140g unsalted butter, softened",
                "300g icing sugar",
                "140g crème fraîche",
                "zest 2 clementines",
                "1 tbsp chopped candied peel(optional)"
            ],
            "method": [
                "Heat oven to 160C/140C fan/gas 3 and grease a 2lb loaf tin. Line the base and ends with a long strip of baking parchment.",
                "Beat the butter, crème fraîche, sugar and vanilla extract until pale and fluffy. Whisk in the eggs, one by one, followed by the flours, poppy seeds, zest and juice. Scrape into the prepared tin and bake on a middle shelf for 1 hr–1 hr 10 mins until a skewer poked into the centre comes out clean. Cool the cake for 20 mins in the tin, then carefully tip out and cool completely on a wire rack.",
                "Meanwhile, make the icing – beat together the butter, icing sugar and crème fraîche until pale and fluffy. Add half the clementine zest and beat just a couple of times to incorporate, then cover and leave in the fridge to chill until the cake is ready to ice and the icing is firm enough to spread or pipe.",
                "Spread the icing all over the cake or put in a food bag or piping bag, snip off the corner and pipe thick stripes over the top. Sprinkle with the remaining clementine zest, the candied peel (if you like), and a pinch more poppy seeds. Will keep in an airtight container for 2-3 days."
            ]
        },
        {
            "name": "Mini chicken fajitas",
            "url": "https://www.bbcgoodfood.com/recipes/mini-chicken-fajitas",
            "author": "Justine Pattison",
            "ingredients": [
                "2 tbsp sunflower oil",
                "2 skinless chicken breasts, cut into 1½ cm/½ in chunks",
                "1 red pepper, deseeded and cut into 1½ cm/½ in chunks",
                "1 yellow pepper, deseeded and cut into 1½ cm/½ in chunks",
                "1 tsp ground cumin",
                "1 tsp ground coriander",
                "¼ tsp hot chilli powder",
                "227g can chopped tomatoes",
                "2 tbsp chipotle paste",
                "4 spring onions, trimmed and thinly sliced",
                "large pack coriander, leaves chopped",
                "3 large flour tortillas",
                "75g ready-grated mozzarella",
                "1 ripe avocado, stoned and peeled",
                "juice 1 large lime",
                "1 garlic clove, crushed",
                "2 heaped tbsp finely chopped coriander",
                "36 cocktail sticks"
            ],
            "method": [
                "Heat the oil in a large, non-stick frying pan or wok and stir-fry the chicken and peppers for 2 mins. Sprinkle over the spices and cook for 30 secs more, stirring. Tip the tomatoes into the pan and stir in the chipotle paste. Simmer for 5 mins or until the sauce is thick and glossy, stirring regularly. Stir in the spring onions and coriander, cook for 1 min more, then remove from the heat and leave to cool.",
                "Cut the tortillas into quarters, then cut each quarter into three pieces, so you have 36 triangles. Place 1 tsp of the chicken mixture and a little cheese at the widest end of a triangle. Roll the pointed end of the triangle around the filling and secure with a cocktail stick. Place on a baking tray lined with baking parchment. Fill and roll the other triangles. Cover with cling film and chill for up to 8 hrs until ready to reheat.",
                "To make the dip, mash all the ingredients in a bowl until almost smooth. Cover the surface of the dip with cling film and chill for up to 24 hrs.",
                "When ready to serve, heat oven to 200C/180C fan/gas 6. Uncover the fajitas and bake for 6-8 mins or until hot throughout. Serve with the guacamole."
            ]
        },
        {
            "name": "Caramel chocolate log",
            "url": "https://www.bbcgoodfood.com/recipes/caramel-chocolate-log",
            "author": "Edd Kimber",
            "ingredients": [
                "butter, for greasing",
                "4 large eggs",
                "125g golden caster sugar, plus extra for sprinkling",
                "25g cocoa powder",
                "50g oat flour(check the label to ensure it’s gluten-free)",
                "100g dulce de leche(or Carnation caramel)",
                "icing sugar, for dusting",
                "50g white chocolate(check the label to ensure it’s gluten-free), melted",
                "400ml double cream",
                "2 tbsp light brown soft sugar",
                "½ tsp ground ginger",
                "½ tsp ground cinnamon",
                "¼ tsp ground cardamom(the seeds from 3 pods, crushed)"
            ],
            "method": [
                "Lightly grease a 26 x 36cm baking tray with a substantial rim and line with baking parchment. Heat oven to 180C/160C fan/gas 4.",
                "To make the filling, put all the ingredients in a small saucepan and bring to the boil over a medium heat, whisking to dissolve the sugar and prevent lumps. Pour into a small container, cover with cling film and place in the fridge for a few hrs or until fully chilled.",
                "Put the eggs and caster sugar in a large bowl and use an electric whisk to whisk for 5-8 mins or until the mixture has tripled in volume and holds a ribbon on the surface when the beaters are lifted from the bowl. In a separate bowl, mix together the cocoa powder, oat flour and a pinch of salt. Working in three additions, carefully sieve the dry ingredients over the egg mixture and carefully fold in, keeping the mixture light and airy. Carefully pour the batter onto the prepared tray and gently level out to an even layer.",
                "Bake for 12-14 mins or until the cake springs back when lightly pressed. Remove from the oven and carefully slip the cake and parchment onto a wire rack to cool (unlike other roll cakes, this one isn’t pre-rolled as it is more likely to crack).",
                "Once the cake is at room temperature, confidently turn over in one motion onto a piece of parchment sprinkled lightly with caster sugar, then peel off the lining parchment.",
                "Whisk the spiced cream filling until it holds soft peaks, then spread to an even layer, leaving 2cm along the short edge clear. Spoon the dulce de leche randomly all over the filling and use a knife or a spoon to swirl together.",
                "Carefully roll the cake, using the parchment underneath to help, making sure the uncovered sponge edge is at the end of the roll. Don’t worry if the cake splits a little, this is to be expected. Dust the cake with a thin layer of icing sugar and carefully lift onto a serving plate. To finish, drizzle the cake with the white chocolate. As this cake is made with very little fat, it is best served on the day it is made, as it will dry out more quickly."
            ]
        },
        {
            "name": "Cranberry & clementine jelly",
            "url": "https://www.bbcgoodfood.com/recipes/cranberry-clementine-jelly",
            "author": "Sara Buenfeld",
            "ingredients": [
                "1kg fresh or frozen cranberry",
                "3 clementines, chopped, peel and all",
                "700g jam sugar",
                "3 tbsp port"
            ],
            "method": [
                "Tip the berries and clementines into a preserving pan, and pour in 1 litre of water. Gently heat, stirring frequently, for 30 mins until the berries are soft. As the mixture softens, lightly crush to release all the juice from the berries. You can do this with a potato masher.",
                "Cool the mixture, then tip it into a jelly bag suspended over a large bowl, or into a large plastic sieve lined with muslin. You need a plastic sieve, as the acidity in the fruit will affect anything metal. Leave overnight so that the juices run through.",
                "The next day, measure the liquid. You should end up with 1.4 litres. If you have less, make up the mixture with water. If more, boil to evaporate the excess. Meanwhile, sterilise your jars and put a small plate in the freezer to chill.",
                "Return the liquid to the pan and add the sugar. Heat until dissolved, then bring to the boil, skimming off any scum that rises to the surface, and allow to cook for about 20 mins. Use a sugar thermometer to take the temperature up to 105C or, after 15 mins, start checking it’s set by dropping the mixture onto a chilled plate. When it is ready, the mixture will appear set when you push your finger through. The drips that come off the spoon will also look syrupy. Spoon off any remaining scum and stir in the Port. Pot into the jars, then leave to set. Will keep for at least a year."
            ]
        },
        {
            "name": "Baked glazed ham",
            "url": "https://www.bbcgoodfood.com/recipes/baked-glazed-ham",
            "author": "John Torode",
            "ingredients": [
                "1 raw smoked gammonon the bone (about 5-6kg), rind left on",
                "100ml maple syrup",
                "200g apricot jam",
                "300g light brown soft sugar",
                "12 whole cloves"
            ],
            "method": [
                "Heat oven to 180C/160C fan/ gas 4. Put the ham on a wire rack or trivet set over a large roasting tin, pour in 480ml warm water and cover tightly with foil. Put the ham in the oven, immediately reduce the heat to 160C/140C fan/gas 3 and cook for 5 hrs.",
                "Meanwhile, put the maple syrup, apricot jam and brown sugar in a heavy-based pan and stir in 50ml water. Bring to the boil, then remove from the heat and leave to cool.",
                "Take the ham out of the oven. Increase the temperature to 200C/180C fan/gas 6. Open the foil, being careful of the hot steam. Remove the rind from the ham by inserting a sharp knife under it at the opposite end to the knuckle bone, gently lifting it away from the fat (try to keep as much fat on the leg as possible so that it will protect the ham and stop it drying out).",
                "Decorate the ham by scoring the fat with a knife to make large diamond shapes, taking the knife from one corner to the other, then making parallel scores 4cm apart. Repeat in the opposite direction. Put a clove in the corner of each diamond. Brush the ham with the sugar mixture, pushing it into the scores with the brush.",
                "Return the ham to the oven, placing it back on the trivet over the water. Bake for a further 45 mins until deeply coloured. Serve hot or cold. Will keep in the fridge for up to one week."
            ]
        },
        {
            "name": "Homemade crumpets with burnt honey butter",
            "url": "https://www.bbcgoodfood.com/recipes/homemade-crumpets-burnt-honey-butter",
            "author": "Marcus Wareing",
            "ingredients": [
                "250ml milk",
                "200g plain flour",
                "1 tsp fast-action dried yeast",
                "1 tsp golden caster sugar",
                "2 tbsp vegetable oil, plus extra for greasing",
                "5 tbsp clear honey",
                "140g unsalted butter, at room temperature"
            ],
            "method": [
                "Gently heat the milk in a small pan until it starts to bubble around the edges, then leave it to cool until it is tepid. Put the flour, yeast, sugar and ½ tsp fine salt in a large bowl, and gradually mix in the cooled milk to make a smooth, loose batter. Cover and leave to rise in a warm place for 1hr-1hr 30 mins or until doubled in size and very bubbly.",
                "Meanwhile, make the honey butter. Heat the honey in a small saucepan over a medium-high heat. Let it bubble until it turns to a deep gold, then remove and cool slightly. Using electric beaters or a wooden spoon, beat the butter in a large bowl until fluffy and pale, add a large pinch of sea salt, then fold in the warm honey. Scrape into a serving bowl and chill. Can be made a day ahead.",
                "When the batter has risen, heat the grill to high. Lightly grease the insides of 4 x 9cm metal cooks’ rings with oil. Heat a large non-stick frying pan over a low-medium heat, add 1 tbsp oil and put the rings in the pan. Spoon the batter into the rings until they are half full. Let the crumpets cook slowly for about 10 mins or until the mixture has set and the bubbles on top have all popped. Lift the rings away carefully. If your pan has a heatproof handle, grill the crumpets in the pan for 7-10 mins or until the tops are golden brown. If not, transfer to a baking sheet and grill them on that instead. Can be made up to a day ahead or frozen. Warm through in an oven at 140C/120C fan/gas 1 if you’ve made them in advance. Repeat with the remaining mix, then serve with the burnt honey butter."
            ]
        },
        {
            "name": "Easy turkey crown",
            "url": "https://www.bbcgoodfood.com/recipes/easy-turkey-crown",
            "author": "Barney Desmazery",
            "ingredients": [
                "50g butter, softened",
                "2kg turkeycrown on the bone",
                "1 tsp Chinese five spiceor a pinch of ground cloves",
                "4 tbsp honey",
                "1 tbsp Dijon mustard",
                "1 tbsp red wine vinegar"
            ],
            "method": [
                "Heat oven to 190C/170C fan/gas 5. Smear the butter all over the turkey crown and season all over with salt and half the five spice. Put in a roasting tin, skin-side up, and roast for 30 mins. While the crown is roasting, mix all the glaze ingredients in a bowl with the rest of the five spice.",
                "Remove the crown from the oven and brush the skin generously with half the glaze. Continue to roast for another hour, glazing twice more, until cooked all the way through and the glaze is sticky and caramelised. Leave to rest for at least 20 mins before carving. Save the juices from the tin to make gravy."
            ]
        },
        {
            "name": "Bread sauce",
            "url": "https://www.bbcgoodfood.com/recipes/bread-sauce",
            "author": "Miriam Nice",
            "ingredients": [
                "1 large onion",
                "12 cloves",
                "2 fresh bay leaves",
                "4 black peppercorns",
                "500ml full-fat milk",
                "1 tsp wholemeal flour",
                "50g fresh breadcrumbs",
                "25g butter",
                "1 tsp freshly grated nutmeg",
                "100ml double cream"
            ],
            "method": [
                "Peel the onion and remove the root. Make 12 holes in the onion using a cocktail stick, and push the cloves into the holes.",
                "Place the onion in a medium saucepan with the bay leaves, peppercorns and milk. Heat gently for 20 mins until the onion is soft, then pour the milk through a sieve into a clean pan and discard the bay, onion and peppercorns.",
                "Heat the infused milk until just simmering, then add the flour, breadcrumbs, butter and nutmeg. Cook for 5 mins more until the sauce has thickened, then add the cream and season well. Can be made up to two days ahead. Reheat gently on the hob before serving."
            ]
        },
        {
            "name": "Mincemeat Chelsea buns",
            "url": "https://www.bbcgoodfood.com/recipes/mincemeat-chelsea-buns",
            "author": "Good Food",
            "ingredients": [
                "250ml whole milk",
                "50g butter, cut into cubes",
                "450g strong plain flour, plus extra for dusting",
                "7g sachet fast-action dried yeast",
                "50g golden caster sugar",
                "1½ tsp ground cinnamon",
                "½ tsp mixed spice",
                "1 large egg, beaten",
                "sunflower or vegetable oil, for greasing",
                "50g butter, softened",
                "25g golden caster sugar",
                "300g mincemeat",
                "100g dried apricot, chopped",
                "100g glacé cherry, chopped",
                "2 tbsp demerara sugar, for sprinkling",
                "2 tbsp apricot jam",
                "100g icing sugar"
            ],
            "method": [
                "Heat the milk in a pan until steaming. Remove from the heat, add the butter, then leave to cool until lukewarm and the butter has melted. Put the flour, yeast, sugar, spices and 1 tsp salt into a large bowl, and mix together. Make a well in the centre, and pour in the egg and milk mixture. Mix everything together with your hands to form a dough – it will be quite wet. Tip the dough onto a lightly floured surface and knead for 5-10 mins until smooth. Transfer the dough to a clean, lightly oiled bowl, cover with oiled cling film and leave to rise until doubled in size – this will take 1-2 hrs depending on how warm the room is. You could rise the dough in the fridge overnight, but make sure you bring to room temperature before moving on to the next step.",
                "Heat oven to 200C/180C fan/gas 6. Tip the dough onto a lightly floured surface and knead for a few moments. Roll out to a 45 x 40cm rectangle, with the longest edge facing you. Mix together the butter and sugar for the filling, and spread all over the dough. Follow with the mincemeat, then sprinkle over the apricots and cherries. Roll up firmly, starting from one of the long sides. Using a sharp knife, cut off either end of the roll to neaten, then slice into 8 even pieces. Arrange, cut-side up, on an oiled tray, leaving about 1cm between each bun and making sure the tail ends are pointing inwards. Cover loosely with oiled cling film and leave to prove until doubled in size – about 30 mins. Sprinkle over the demerara sugar and bake for 22-25 mins until golden brown. Transfer to a wire rack. Melt the jam with ½ tbsp water and brush over the buns, then leave to cool.",
                "Mix the icing sugar with enough water to make a runny icing. Using a spoon, drizzle the icing back and forth over the buns. Leave for 10 mins to set before eating. Will keep in a sealed container for up to 3 days."
            ]
        },
        {
            "name": "Smoked salmon soufflés",
            "url": "https://www.bbcgoodfood.com/recipes/13382/smoked-salmon-souffls",
            "author": "Sara Buenfeld",
            "ingredients": [
                "40g butter",
                "25g plain flour",
                "300ml milk",
                "85g Philadelphia cheese",
                "2 tsp chopped dill",
                "3 large eggs, separated",
                "85g smoked salmon, chopped",
                "zest ½ lemon",
                "6 tsp crème fraîche",
                "2 large slices smoked salmon",
                "dillsprigs"
            ],
            "method": [
                "Put the butter, flour and milk in a pan and cook, stirring over the heat until thickened. Stir in the cheese, in small spoonfuls, and the dill; season to taste, then beat to incorporate.",
                "Heat oven to 200C/180C fan/gas 6. Butter 6 x 150ml soufflé dishes and line the base with baking paper. Stir the egg yolks into the sauce, add the chopped salmon and lemon. Whisk the egg whites until stiff, then carefully fold into the salmon mix. Spoon into the dishes and bake in a tin half-filled with cold water for 15 mins until risen and golden. Cool; don’t worry if they sink.",
                "To freeze, cool completely, then overwrap the dishes with baking paper and foil. They will keep in the freezer for 6 weeks. Thaw for 5 hrs in the fridge.",
                "When ready to serve, very carefully turn the soufflés out of their dishes, peel off the lining paper and place on squares of baking paper. Top with the crème fraîche and bake for 10-15 mins at 200C/180C fan/gas 6 until the soufflés start to puff up. Quickly top each with a frill of salmon and a dill sprig. Serve on their own or with some dressed salad leaves."
            ]
        },
        {
            "name": "Magical reindeer cake",
            "url": "https://www.bbcgoodfood.com/recipes/magical-reindeer-cake",
            "author": "Juliet Sear",
            "ingredients": [
                "200g salted butter, softened, plus more for the tin",
                "200g plain chocolate, chopped",
                "240g light muscovado sugar",
                "3 medium eggsand 3 medium egg yolks, beaten together",
                "2 tsp vanilla bean paste",
                "150g full-fat soured cream",
                "180g self-raising flour",
                "40g cocoa powder",
                "1 tsp baking powder",
                "200g dark chocolate",
                "100g salted butter",
                "50g double cream",
                "200g unsalted butter, very soft",
                "2 tsp vanilla bean paste",
                "400g unrefined Billington's icing sugar, sifted (this is a pale biscuit colour, not white)",
                "200g light muscovado sugar",
                "200g butter, softened",
                "1 tsp vanilla bean paste",
                "1 large egg",
                "375g plain flour",
                "2 tsp ground ginger",
                "2 tsp cinnamon",
                "large pinch mixed spice",
                "Brown, black, red, green and white ready-to-roll fondant icing"
            ],
            "method": [
                "Butter and line 3 x 15 or 16cm round tins (alternatively do the baking in batches if you only have one tin). Heat the oven to 170C/150C fan/gas 3.",
                "Gently melt the chocolate, butter and sugar together in a large microwave-safe bowl on medium heat for a minute at a time, stirring until melted or, set a bowl over a pan of simmering water. Leave to cool a little.",
                "Beat together the eggs with the vanilla and soured cream in a bowl. Sift the flour, cocoa and baking powder into another bowl and whisk to distribute. Stir the egg mix into the cooled melted chocolate, then fold in the flour mix and fold through until all the powder has disappeared.",
                "Spoon a third of the mixture into each tin (if you weigh the tins, you can get it perfectly even and your cakes will cook at the same rate and to the same height). Level off each thin layer with the back of a spoon.",
                "Bake until just cooked, so when a skewer poked into the centre of the sponge layer comes out with a few crumbs and the cakes are shrinking away from the tin a bit. This will take about 25-30 mins, but check after 20 to be safe as all ovens vary. Remove and cool in the tins on a wire rack, or on top of cold oven hob rings.",
                "Meanwhile, to make the ganache, microwave all the ingredients together in 30 sec bursts until they have all melted, stirring at each interval. Or melt everything together in a bowl set over a pan of simmering water. Cool to room temperature before adding to the buttercream.",
                "To make the buttercream, beat the butter and vanilla paste until pale and creamy. Gradually add the icing sugar, beating well between each addition. (Using unrefined sugar will give the buttercream a natural caramel flavour.) Beat in the cooled ganache.",
                "To make the antlers, combine the sugar and butter with the vanilla paste until amalgamated but not creamed. Add the egg and combine. Mix the flour with the spices then tip that in and mix to form a dough. Wrap in cling film and chill in the fridge to firm up for 20 minutes. Roll out on a floured surface to a 5/6mm thickness. Lay the template on the dough and cut around it using a small sharp knife – make two sets in case of breakages (any additional dough can be saved). Push the lolly sticks up into the bottom of the antlers and bake for around 15-20 mins until cooked through and golden. Allow to cool.",
                "Make the ears by pulling a little of the brown fondant icing off the block and kneading it with white fondant icing to make a pale brown. Roll the rest of the dark brown icing out thickly on a surface dusted with icing sugar. Roll the paler icing out thinly. Cut large teardrop shapes from the lighter icing to form the ears (about 6cm in size) and stick the lighter shape on top of the darker icing with a little water. Cut a larger teardrop around the lighter shape. Fold and pinch together at the base, push a cocktail stick into the bottom of each one and set aside to firm up.",
                "Trim the cakes flat if they have a little hump where they have been baked. Put the first layer onto a 16cm cake board and use a little of the chocolate frosting to secure it to the board. Spread frosting over the first layer then add layer two. Sandwich together by pressing gently and add another layer of frosting to this layer. For the last layer, take the sponge and invert it on top of the other two cakes, so that the smooth part of the cake – that was on the bottom of the tin –becomes the top. This will make it nice and neat. Spread a very thin layer of icing over the whole cake to crumb coat it and chill to set for about 30 mins.",
                "Add more buttercream to the cake to make a clean top coat – use a palette knife or side scraper to get a smooth finish (but do save a little of the buttercream for the final flourish). Mark out the eyes with a cutter so you can see where to add them. Roll little strips of black fondant icing for the eyes and lashes, then stick these onto the cake. Mould the nose with red fondant icing and stick it on with a cocktail stick, pushing one end into the nose and the other into the cake.",
                "For the little collar, roll out about 100g of green fondant icing on a surface dusted with icing sugar and cut a thin strip for the bow that will fit around the base of the cake. Stick the ends together with a little water, then make a bow by folding another thin strip and stick this onto the collar with another dab of water. Scoop the leftover buttercream into a bag with a large star nozzle. Pipe some fluffy reindeer hair on top of the cake, then add the ears and biscuit antlers, pushing them in gently but firmly."
            ]
        },
        {
            "name": "Chestnut & wild mushroom stuffed three-bird roast",
            "url": "https://www.bbcgoodfood.com/recipes/chestnut-wild-mushroom-stuffed-three-bird-roast",
            "author": "Barney Desmazery",
            "ingredients": [
                "1 medium-large chicken(1.8-2kg is ideal)",
                "1 pheasant",
                "1 duck breast, skinned",
                "2 shallots, roughly chopped",
                "½ large pack thyme",
                "1 large carrot, roughly chopped",
                "50g softened butter",
                "1 glass of white wine",
                "2 tbsp plain flour",
                "300ml chicken stock",
                "25g dried porcinimushrooms",
                "25g butter",
                "2 shallots, finely chopped",
                "½ pack thyme",
                "100g cooked chestnut, crushed",
                "200g good-quality pork sausage, skinned",
                "small pack parsley, roughly chopped",
                "zest 1 lemon, roughly chopped",
                "2 tbsp breadcrumb"
            ],
            "method": [
                "For the stuffing, soak the porcini in 300ml boiling water and set aside for 20 mins, then drain, reserving the liquid, and finely chop. Heat the butter and fry the shallots for 2 mins, then add the mushrooms and cook for 3 mins more. Leave to cool. Mix with all the other stuffing ingredients and set aside.",
                "Place the chicken, breast-side down, on the board. Use a sharp boning knife to cut through the skin on the backbone along the length of the bird. Slowly run your knife down against one side of the ribcage, working down the length of the chicken and keeping close to the bone. As you cut, use the other hand to gently pull away the skin and expose the flesh. Pop out the thigh and wing joints, and cut through where they are attached to the main carcass. Continue cutting down the side of the bird, keeping the knife as close to the carcass as possible, until you reach the ridge of the breast bone, then repeat with the other side.",
                "To remove the carcass completely, snap away the wishbone where it joins at the neck end and carefully cut beneath the breast bone – this is where the skin is at its thinnest, so carefully cut away, then lift and cut away the carcass, as you don’t want to nip or pierce the skin.",
                "Open up the chicken, skin-side down, and scrape clean or cut away the thigh bones and any other stray bits of bone or cartilage like the wishbone. Remove the 2 smaller fillets that run along the breast and set aside. Finally, use a larger chopping knife to cut off the feet and wing tips, but don’t discard them.",
                "Repeat with the pheasant, but cut the legs off completely so you are left with just the 2 breasts attached by the skin. Cut the legs in half and keep. You should now have the semi-boned chicken, the pheasant breasts, the skinned duck breast and the stuffing. If all that butchery doesn’t appeal, your butcher – with a bit of warning – should be able to prepare all the birds to this stage for you.",
                "To assemble the roast, open up the chicken, skin-side down. Put a third of the stuffing between 2 pieces of cling film and use a rolling pin to roll it out flat so that it just covers the surface area, then place on top of the chicken. Lay the duck breast in the middle of the stuffing, cover with a layer of stuffing, then add the pheasant breasts, skin-side down. Add a final layer of stuffing and lay the 2 chicken mini fillets on top.",
                "Tuck in the top and bottom edges of the chicken, and pull the two long edges together. Tuck one edge of it over the other so everything is rolled together and neatly encased, then flip over. Using butcher’s string, tie the chicken at regular intervals around the width, then tie it once around the length to hold the stuffing in. Finally, tie the legs together. Can be prepared to this stage and chilled up to 1 day ahead.",
                "Heat oven to 200C/180C fan/gas 6. Scatter the shallots, thyme and carrot into a roasting tin with the pheasant legs and chicken wing tips. Place the roast on the vegetables and rub all over with the softened butter. Pour the wine over, then season generously. Put the tin in the oven and cook for 1 hr 40 mins until beautifully browned all over, or until a digital cooking thermometer reads 68C (or above) when inserted in the middle. Remove, loosely cover with foil, and leave to rest somewhere warm for 30 mins.",
                "While the roast is resting, make the gravy. Place the tin on a low flame if flameproof, or tip the contents into a saucepan if not. Scatter over the flour and cook until light brown. Gradually pour in the mushroom soaking liquid, then the chicken stock. Simmer everything together until you have a smooth, thickened gravy, adding any resting juices from the roast. Season to taste, then strain the gravy through a sieve into another saucepan. When the roast has rested, remove the string, carefully carve into thick slices and sprinkle with thyme."
            ]
        },
        {
            "name": "Spiced oatmeal fritters with coconut caramel pears",
            "url": "https://www.bbcgoodfood.com/recipes/spiced-oatmeal-fritters-coconut-caramel-pears",
            "author": "Marcus Wareing",
            "ingredients": [
                "250ml almond milk",
                "½ tsp ground cloves",
                "1 tsp ground nutmeg",
                "4 tsp ground cinnamon",
                "100g rolled oats",
                "3 large eggs",
                "2 tbsp golden caster sugar",
                "75g coconut butter",
                "2 firm Williams pears, peeled, cored and thinly sliced",
                "200g coconut yogurt, to serve"
            ],
            "method": [
                "In a large saucepan, combine the almond milk, cloves, nutmeg and 3 tsp of the cinnamon. Bring to a simmer. Tip in the oats and cook for 6 mins over a low heat, stirring constantly, until thick and creamy, like porridge. Scrape into a mixing bowl, cover, and cool for 20 mins.",
                "While you wait, make the caramel pears. Sprinkle the sugar evenly over a frying pan set on a low heat. Don’t stir it, but wait until it starts to melt, turning dark golden here and there. When most of the sugar is melted, gently swirl to incorporate any dry patches. Stir in 25g of the coconut butter. Toss the pear slices in the remaining cinnamon, then add to the caramel and cook for 5 mins until softened. Set aside.",
                "Return to the oats now, beating in the eggs and ½ tsp salt to make a loose pancake-like batter. Heat oven to 140C/120C fan/gas 1 and put plates in to warm.",
                "Melt a little of the remaining coconut butter in a frying pan. When hot, add half-ladlefuls of the batter spaced apart and cook for 4 mins each side, or until golden brown. Remove to a plate and keep warm in the oven. Continue frying the fritters, adding more coconut butter as needed. Serve the fritters topped with a spoonful of coconut yogurt followed by the warm pears."
            ]
        },
        {
            "name": "Spicy satay wings with peanut sauce",
            "url": "https://www.bbcgoodfood.com/recipes/spicy-satay-wings-peanut-sauce",
            "author": "Good Food",
            "ingredients": [
                "1.6kg whole chicken wings",
                "sweet chilli sauce",
                "1 cucumber, deseeded and cut into sticks, to serve",
                "1 tbsp vegetable oil",
                "1 tbsp light soy sauce",
                "2 heaped tsp turmeric",
                "2 heaped tsp ground cumin",
                "4 garlic cloves, crushed",
                "2 tbsp coconut cream",
                "3 tbsp golden caster sugar",
                "1 tbsp sunflower oil",
                "3 garlic cloves, crushed",
                "knob of ginger, finely grated",
                "1 lemongrassstalk, bruised",
                "1 Thai chilli, pricked all over with the tip of a knife (see tip, top left)",
                "1 tsp ground cumin",
                "4 tbsp crunchy peanut butter",
                "1 tbsp golden caster sugar",
                "2 tbsp coconut cream",
                "100ml chicken stock(see 'Tip')"
            ],
            "method": [
                "Using a sharp knife or kitchen shears, snip the wing tips from the wings at the first knuckle. Discard the tips or use to make stock (see above left). Cut the remaining wing through the joint. Put the wings in a large non-metallic bowl or a food bag. Mix together the marinade ingredients and pour over the wings, toss well to coat, then chill for at least 4 hrs or overnight.",
                "For the sauce, heat the oil in a pan, then add the garlic, ginger, lemongrass and chilli, and fry for 30 secs until aromatic. Stir in the cumin, toast for a few secs, then stir in the remaining ingredients. Simmer just long enough to make a slightly thickened sauce. Spoon into a bowl, cover and leave to cool. Can be made up to 3 days ahead and chilled.",
                "Heat oven to 200C/180C fan/gas 6. Spread the wings over a large baking tray, sprinkle with a little salt and roast for 40-45 mins, turning halfway, until crisped and golden. If a large amount of juice has collected in the tray at the halfway point, pour it away before continuing to roast. Just before serving, warm the peanut sauce gently and remove the lemongrass and chilli. Serve with the wings, sweet chilli sauce and cucumber sticks."
            ]
        },
        {
            "name": "Potted salmon rillette",
            "url": "https://www.bbcgoodfood.com/recipes/potted-salmon-rillette-0",
            "author": "Good Food",
            "ingredients": [
                "100g cream cheese",
                "100g crème fraîche, soured cream, double or whipping cream – or a mixture of all your leftovers",
                "100g smoked salmontrimmings, half diced, plus extra to decorate (optional)",
                "2-3 tsp creamed horseradish",
                "lemonwedge",
                "few dillsprigs, to decorate (optional)",
                "melba toast, crackers or toasted rye bread, and a few leaves, to serve"
            ],
            "method": [
                "Put the cream cheese, the leftover creams, 50g salmon, 2 tsp horseradish and a small squeeze of lemon juice in a food processor or blender. Whizz until smooth, then scrape into a mixing bowl. Fold in the remaining salmon, then taste – add another tsp horseradish if you like, plus seasoning if needed. Divide the mixture between 4 small ramekins and chill for at least 2 hrs.",
                "Before serving, decorate the rillettes with a spiral of salmon or a few dill sprigs, if you like. Add a pot to a plate with a few leaves and some crunchy Melba toast, or similar, and serve."
            ]
        },
        {
            "name": "Rich nutmeg ice cream",
            "url": "https://www.bbcgoodfood.com/recipes/3044/rich-nutmeg-ice-cream",
            "author": "Jane Hornby",
            "ingredients": [
                "284ml pot double cream",
                "200ml full-cream milk",
                "6 egg yolks",
                "50g sugar",
                "1 tsp freshly-grated nutmeg"
            ],
            "method": [
                "Heat the double cream and the full-cream milk in a pan until just starting to boil.",
                "Meanwhile whisk the egg yolks and sugar in a large bowl. When milk and cream mix is ready, steadily pour it over the yolks, whisking continuously.",
                "Pour back into a clean pan, then heat gently, stirring, for about 10 mins until the mix thickens enough to coat the back of a spoon. Strain custard through a sieve into another large bowl, stir in the freshly-grated nutmeg, then cool.",
                "Churn in an ice cream machine or pour into a freezer-proof container, then freeze for about 1½ hrs until frozen around the edges. Stir the frozen edges into the mix, then repeat this twice more or until the ice cream is smooth and thick. Leave for at least 4 hrs to freeze before serving with Sticky orange & marsala pudding (see link, right)."
            ]
        },
        {
            "name": "Herby slashed roasties",
            "url": "https://www.bbcgoodfood.com/recipes/2712/herby-slashed-roasties",
            "author": "Jane Hornby",
            "ingredients": [
                "2¼kg floury potatoes, such as Maris Piper, unpeeled",
                "10 small bay leaves",
                "handful thyme sprigs",
                "2 tbsp butter",
                "light olive oil"
            ],
            "method": [
                "Bring a large saucepan of water to the boil and heat oven to 200C/fan 180C/gas 6. Cut the potatoes into halves or quarters depending on their size. Tip into the pan, allow the heat to come back up, then boil for 6-10 mins until just starting to soften around the edges. Drain in a colander and return to the pan. With the lid on, shake the potatoes until the edges fluff up.",
                "Leave the potatoes until cool enough to handle. Slash half the chunks once with a small knife and stuff alternately with bay or thyme.",
                "Heat the butter and oil in a large roasting pan either in the oven or on the hob until the butter turns golden. Carefully tip in the potatoes and gently turn in the fat (tongs are best for this). Sprinkle with sea salt and black pepper to taste and roast for 1-1¼ hrs until crisp and golden, turning halfway through."
            ]
        },
        {
            "name": "Coconut bauble truffles",
            "url": "https://www.bbcgoodfood.com/recipes/coconut-bauble-truffles",
            "author": "Sarah Cook",
            "ingredients": [
                "250g madeira cake",
                "85g ready-to-eat dried apricots, finely chopped",
                "25g desiccated coconut",
                "125ml light condensed milk",
                "140g desiccated coconut",
                "different food colourings, we used yellow, pink, blue and purple"
            ],
            "method": [
                "In a big mixing bowl, crumble the cake with your fingers – try to get the bits as small as possible.",
                "Tip in the apricots and coconut. Using your hands again, mix together with the cake crumbs. Use a wooden spoon to stir in the condensed milk. After you’ve mixed it in a bit, use your fingers to pull off any bits stuck to the spoon. Squidge everything together with your hands until it is well mixed and all the cake crumbs are sticky. Rub your hands together over the bowl so any bits that are stuck drop off.",
                "Line some trays that fit in your fridge with baking parchment. Roll the sticky cake mixture into small balls (about the size of a conker or gobstopper) between your hands. Line them up on the trays, then put them in the fridge while you get the decorations ready.",
                "Decide on how many different food colourings you are going to use, then split the coconut into the same number of piles. Put each pile of coconut into a plastic sandwich bag, add a few drops of food colouring to each, and tie a knot in the top. Shake the bags and scrunch between your fingers until all the coconut is coloured – if it’s not bright enough, open the bag and add a few more drops of colouring.",
                "Open all the bags of coloured coconut and take the truffles from the fridge. Put 1 tbsp of water in a small bowl and lightly coat each truffle in it so the coconut can stick to the outside of each bauble.",
                "One by one, drop each truffle into one of your bags. Shake it and roll it around until the outside is covered in coconut. Carefully put each truffle back onto the trays and chill for at least another 2 hrs until they are really cold and firm.",
                "If you like, put some of the truffles in gift bags or boxes and tie with ribbons to give as presents. Will keep in the fridge for up to 1 week."
            ]
        },
        {
            "name": "Mustard butter-basted roast turkey with bacon",
            "url": "https://www.bbcgoodfood.com/recipes/mustard-butter-basted-roast-turkey-bacon",
            "author": "Sara Buenfeld",
            "ingredients": [
                "5-5½ kg oven-ready turkey, neck and giblets removed (save them to make stock, if you like)",
                "250g pack dry-cured smoked streaky bacon(about 12 rashers)",
                "a little mustard(optional)",
                "drizzle of olive oil",
                "sea saltflakes",
                "1 onion, quartered",
                "1 large thyme sprig",
                "a few bay leaves",
                "glass of dry white wine",
                "bay leaves and chopped thyme, for scattering",
                "85g butter, softened",
                "1 tbsp wholegrain mustard",
                "1 tsp English mustard",
                "1 tbsp fresh thyme leaves"
            ],
            "method": [
                "Weigh your turkey and calculate the cooking time by allowing 40 mins per kg for the first 4kg, then 45 mins for every kg of turkey over that weight. As a guide, a turkey this size should take 3½-4 hrs plus 30-45 mins resting time.",
                "To make the mustard butter, beat the butter with the mustards, thyme and some ground black pepper until soft and well mixed.",
                "Gently push your fingers under the skin of the turkey, starting from the neck, until you can push your whole hand in down the length of the breast – take care not to tear the skin. Spread the butter under the skin so that it covers the breasts. Lay the streaky bacon on your work surface in 2 rectangles of 6 overlapping rashers (for extra flavour, you can brush the bacon with a little wholegrain or English mustard first), and carefully push each rectangle of bacon under the skin to cover and protect each breast. This can be done the night before, but take out of the fridge for 1 hr before roasting so that it comes back to room temperature.",
                "On the day, heat oven to 180C/160C fan/gas 4. Lift the turkey into a roasting tin, massage the olive oil into the skin and season well with flaky salt and pepper. Put the onion, thyme and bay inside the cavity of the turkey, then pour in the wine. Cover the tin loosely with foil and roast for the calculated cooking time. For the final 30 mins, remove the foil and pour off all of the cooking juices (use for the gravy; recipe in 'goes well with'). Increase the oven to 200C/180C fan/gas 6 and roast for 30 mins more until the turkey is golden and the juices that run out of the thigh are clear, with no sign of pink, when pierced with a skewer. Leave to rest on a warm platter covered with foil and tea towels – it will keep like this for up to 45 mins.",
                "To serve, carve the turkey and arrange the meat on a hot platter with a little of the hot gravy poured over, or bring the whole turkey to the table garnished with herbs. To fill the platter, you could surround the turkey with potatoes, if you like. Any leftover meat can be frozen in the gravy."
            ]
        },
        {
            "name": "Lobster muffins with poached egg, caviar, spinach & hollandaise",
            "url": "https://www.bbcgoodfood.com/recipes/lobster-muffins-poached-egg-caviar-spinach-hollandaise",
            "author": "Tom Kerridge",
            "ingredients": [
                "½ lobster, about 300g meat (see tip, top right)",
                "25g butter, for reheating the lobster",
                "2 very fresh eggs",
                "1 tsp white wine vinegar",
                "large knob of butter",
                "100g bag baby spinach, washed",
                "whole nutmeg",
                "2 tsp Avruga caviar",
                "350g strong white bread flour",
                "7g sachet fast-action dried yeast",
                "175ml warm milk",
                "1 egg, beaten",
                "fine polenta or semolina, for dusting",
                "50ml white wine",
                "100ml white wine vinegar",
                "1 shallot, finely chopped",
                "½ small bunch tarragon",
                "¼ tsp whole black peppercorns",
                "1 large egg yolk",
                "1 tbsp double cream",
                "125g butter, melted",
                "cayenne pepper, to taste",
                "1-2 tbsp lemon juice, to taste"
            ],
            "method": [
                "First make the muffins. Mix together the flour, yeast and 3/4 tsp salt in a food mixer with the dough hook, or in a large bowl if making by hand. Add the milk and egg, and mix to a dough. Leave the mixture in the machine with the motor running and knead the mix for 5-6 mins until it becomes elastic and smooth, or for 10-15 mins by hand. Place the dough in a bowl, cover with cling film and place in a warm spot to prove.",
                "When it has doubled in size, punch the dough down with your hand and turn out. Dust your work surface and a baking tray with the polenta or semolina. Roll out the dough until 2.5cm thick and cut out muffins using a 9cm straight-edged cutter – you should have about 4 muffins. Transfer them to the tray, cover with cling film and leave to prove for 20-25 mins or until doubled in size.",
                "Put a piece of baking parchment in a non-stick frying pan and put the pan on a low heat. Gently transfer the muffins to the pan and cook them in batches for 5-6 mins each side until they are toasted and brown. Remove from the pan and leave to cool on a wire rack. When cool, these freeze very well in freezer bags – then simply toast them from frozen. Keep 2 out for your lobster.",
                "To make the hollandaise, put the wine, vinegar, shallot, tarragon and peppercorns in a small pan and bring to the boil. Simmer for 8-10 mins or until the mix is reduced to one-third of its original volume. Remove from the heat and leave to cool. Meanwhile, fill a pan one-third with water, bring to the boil, then reduce to a simmer. Strain the infused vinegar mixture into a mixing bowl, add the egg yolk and a large splash of water. Place the bowl over the top of the pan of simmering water (but not touching the water) and whisk. The sauce will lighten in colour and fluff up – this is called a sabayon. Do not overcook or it will look like scrambled eggs. When it is fluffy but firm, add the splash of double cream, then slowly pour in the melted butter – not too quickly – imagine you are making mayonnaise, drizzling in a small amount at a time. When all the butter has been incorporated, season with salt, cayenne and lemon juice. Pass the hollandaise through a fine sieve into a bowl. Cover with cling film and keep warm until needed.",
                "Prepare the lobster. Twist the claws and pull the tail off the lobster, then bash the claws with a rolling pin to crack the shell and reveal the meat. Remove the shell from the tail, then cut the tail in half lengthways and remove the intestine. You should now have half a tail and a claw per person. Remove the meat from the shell. To reheat the meat, melt the butter with 2 tbsp water in a medium saucepan. Add the lobster meat and warm over a gentle heat.",
                "To poach the eggs, bring a small pan of water to the boil and add a splash of white wine vinegar. Spin the water around with a slotted spoon and crack in the eggs – they must be very fresh. Turn off the heat and leave them to poach for 2-3 mins until set but still soft.",
                "Meanwhile, melt the knob of butter in a pan. Add the spinach and stir until it starts to wilt. Season and grate over a little nutmeg. Remove from the heat and drain the spinach on kitchen paper. To serve, halve 1 muffin and lightly toast to warm through. Put half a muffin on each plate and top with the spinach, then add the portioned warm lobster. Place a poached egg on top, then spoon over the hollandaise and a dollop of caviar."
            ]
        },
        {
            "name": "Ham & watercress salad with clementine dressing",
            "url": "https://www.bbcgoodfood.com/recipes/ham-watercress-salad-clementine-dressing",
            "author": "Emily Kydd",
            "ingredients": [
                "250g pouch ready-to-eat mixed grains",
                "280g leftover ham, shredded or cut into chunks",
                "100g bag watercress",
                "1 small fennel bulb, thinly sliced",
                "50g hazelnuts, toasted and roughly chopped",
                "small bunch parsley, roughly chopped",
                "1½ tbsp dried cranberries, roughly chopped",
                "2 tbsp extra virgin olive oil",
                "zest 1 clementineand juice of 2",
                "2½ tsp Dijon mustard",
                "good drizzle of clear honey"
            ],
            "method": [
                "For the dressing, put all the ingredients in a jar, along with some seasoning, pop on the lid and give it a really good shake.",
                "Tip the grains into a large bowl and toss through the ham, watercress, fennel, hazelnuts and parsley. Just before serving, pour over the dressing and gently toss to combine. Transfer to a serving platter and scatter over the dried cranberries."
            ]
        },
        {
            "name": "Fig & pancetta American stuffing",
            "url": "https://www.bbcgoodfood.com/recipes/fig-pancetta-american-stuffing",
            "author": "Emma Freud",
            "ingredients": [
                "75g butter, plus extra for greasing",
                "150g diced pancetta",
                "150g Italian sausages, chopped",
                "1 large onion, finely chopped",
                "1 celery stick, finely chopped",
                "1 tbsp chopped rosemary",
                "2 garlic cloves, grated",
                "150g ciabattaor sourdough bread, cut into small cubes",
                "2 eggs",
                "150ml chicken stock",
                "150g dried figs, roughly chopped",
                "2 tbsp roughly chopped parsley",
                "100g cooked whole chestnuts, roughly chopped"
            ],
            "method": [
                "Heat oven to 180C/160C fan/ gas 4 and grease a large baking tray. Fry the pancetta in a large, dry frying pan until crisp and golden, then transfer to a large bowl with a slotted spoon. In the same pan, fry the sausages until lightly browned, then add to bowl with the pancetta. Melt all the butter in the same pan and fry the onion, celery, rosemary and garlic for about 15 mins until very soft",
                "Meanwhile, put the cubes of bread on a baking tray and toast in the oven until pale golden. Cool, then blitz half the cubes in a food processor. Beat the eggs with the chicken stock.",
                "Add the figs, parsley and chestnuts to the pan with the onion mixture. Stir for a few mins, then transfer to the bowl with the pancetta and sausage. Add all the bread and a really generous sprinkling of seasoning. Using your hands, toss all the ingredients gently together, then add the egg and stock mixture.",
                "Divide the mixture into 16 balls and place on the prepared baking tray. Bake, covered with some greased foil, for 30 mins, then remove the foil and bake for another 10 mins until golden and crispy. Once you’ve taken the stuffing out of the oven, season again and serve."
            ]
        },
        {
            "name": "Vegan gingerbread people",
            "url": "https://www.bbcgoodfood.com/recipes/vegan-gingerbread-people",
            "author": "Miriam Nice",
            "ingredients": [
                "1 tbsp chia seeds",
                "400g plain flour, plus extra for dusting",
                "200g coconut oil",
                "2 tbsp ground ginger",
                "1 tsp ground cinnamon",
                "200g dark muscovado sugar",
                "50g maple syrup",
                "100ml aquafaba(water from a can of chickpeas)",
                "500g icing sugar",
                "½ tsp lemon juice"
            ],
            "method": [
                "Put the chia seeds in a small bowl and stir in 3 tbsp water. Leave to soak for 5-10 mins until gloopy. Meanwhile put the flour into a large mixing bowl and rub in the coconut oil until it’s almost disappeared into the flour. Stir in the spices.",
                "In another bowl mix together the sugar, maple syrup, chia mixture and 2 tbsp water until smooth then pour over the flour. Stir until well combined then knead together to make a soft dough. Wrap in cling film until ready to use.",
                "Heat oven to 180C/160C fan/gas 6. Roll out the dough on a lightly floured surface then cut into gingerbread people (or whatever shape you like) and bake for 10-12 mins on baking sheets lined with baking parchment until just starting to darken at the edges. Let them cool for a couple of minutes on the tray then transfer to a wire rack to cool.",
                "While the gingerbread cools whip the aquafaba in a bowl using electric beaters until really foamy. Add 3/4 of the icing sugar and whisk until smooth and thick, then whisk in the rest of the icing sugar and the lemon juice. Whisk again until the mixture forms stiff peaks. Transfer to a piping bag until ready to use. Snip a little off the end of the piping bag and use to create designs and faces on your gingerbread."
            ]
        },
        {
            "name": "Hazelnut crunch mince pies",
            "url": "https://www.bbcgoodfood.com/recipes/hazelnut-crunch-mince-pies",
            "author": "Cassie Best",
            "ingredients": [
                "250g plain flour, plus extra for dusting",
                "100g chopped hazelnuts",
                "75g icing sugar, plus extra for dusting",
                "140g cold butter, cut into cubes",
                "1 egg, separated",
                "400g good-quality mincemeat",
                "1 small eating apple, grated",
                "zest 1 orange"
            ],
            "method": [
                "Put the flour, half the hazelnuts, the icing sugar and butter in a food processor and blitz to a sandy texture. Add the egg yolk and 1-2 tbsp water, and blitz briefly until the dough clumps together. Tip out onto a work surface and knead the dough a little until smooth. Flatten to a puck shape, wrap in cling film, then chill for 30 mins.",
                "Mix the mincemeat, apple and orange zest in a bowl. Heat oven to 200C/180C fan/gas 6. Unwrap the pastry and roll out on a lightly floured surface to the thickness of a £1 coin. Stamp out 12 circles with a 10cm fluted biscuit cutter and use them to line a 12-hole muffin tin.",
                "Fill each pie with the mincemeat mixture. Scrunch up the pastry trimmings and re-roll to the same thickness as before. Stamp out 6 circles using an 8cm cutter, and 6 stars. Put the remaining hazelnuts in a dish and lightly whisk the egg white in another. Brush a little egg white around the inner rim of each pie, then brush one side of each pastry lid, and the stars. Press each lid into the hazelnuts, egg-side down, so they stick, then lightly press on top of the pies, nutty-side up. Repeat with the stars and place these on the remaining pies.",
                "Bake for 20 mins or until golden and crisp. Leave to cool in the tin for 5 mins, then scoop out and cool on a wire rack. Dust with icing sugar before serving. Will keep in a sealed container for 3 days."
            ]
        },
        {
            "name": "Rudolph shortbread",
            "url": "https://www.bbcgoodfood.com/recipes/rudolph-shortbread",
            "author": "Sarah Cook",
            "ingredients": [
                "200g salted butter, softened",
                "2 tsp vanilla extract",
                "85g golden caster sugar",
                "85g ground rice",
                "225g plain flour, plus extra for dusting",
                "3 tbsp icing sugar",
                "8 red Smarties",
                "16 white sweetsor white chocolate buttons, for the eyes (we used Waitrose Cooks' Homebaking Meringue pieces)",
                "black writing icingtube",
                "8 cellophane bags(15 x 25cm) or 8 x 40cm cellophane squares",
                "8 brown pipe cleaners",
                "labels and stringor ribbon",
                "22-23cm round plate, cake tinor cardboard template"
            ],
            "method": [
                "Put the butter, vanilla and sugar in a big mixing bowl and stir together with a wooden spoon until really smooth. Stir in the ground rice first, then the flour. If it starts to get dry, you might need to use your hands to squish everything together to make a smooth dough.",
                "Put a piece of baking parchment on a baking sheet. Make the dough into a round ball in the middle of the parchment, then use your hands to push it down and flatten it. Get a rolling pin and dust it with some flour so it doesn’t stick to the dough. Use the rolling pin to roll the dough out to a big circle.",
                "Get your 22-23cm round plate, cake tin or cardboard template and place on top of the dough when you’ve rolled it big enough. Use a cutlery knife to trim round the edges to make a neat circle and throw away the trimmings.",
                "Use a knife to mark the giant biscuit into 8 smaller wedge-shaped biscuits – pretend you are cutting a pizza into slices but don't actually cut it. Prick lines from the edge to the centre of the dough. Use the back of a fork to press all around the top of the circle along the edge to make a line pattern (it’s going to be hair for your reindeer!)",
                "Cover with cling film and put the tray in the fridge for 30 mins to get cold. Heat oven to 180C/160C fan/gas 4. Cook the chilled shortbread for 25 mins until golden. Cool completely on the tray, then use a sharp knife to follow the lines you made with a fork and cut into 8 wedges.",
                "Mix the icing sugar with 1-2 tsp of water to make a thickish icing. Dunk each Smartie in and use like glue to stick one on the pointy end of each biscuit to make red noses. Dunk in your white sweets or chocolate buttons and stick them 2cm in from the edge at the other end to be eyes. Use the black writing icing tube to add dots to the white eyes, then let all the icing dry and go hard.",
                "Carefully wrap each biscuit in a square of cellophane or put in a cellophane bag. Twist the middle of a pipe cleaner in a loop around the top of the bag or gathered cellophane to enclose the biscuit. Now twist each end of the pipe cleaner so it looks like the reindeer’s antlers. Add labels and give to your friends and family, or hang on the tree. Will keep for up to 3 days in a cool, dry place."
            ]
        },
        {
            "name": "Festive red cabbage",
            "url": "https://www.bbcgoodfood.com/recipes/festive-red-cabbage",
            "author": "Good Food",
            "ingredients": [
                "1 tbsp vegetable oil",
                "2 large onions, finely chopped",
                "1 star anise",
                "1 cinnamon stick",
                "150ml red wine",
                "1 red cabbage(about 900g/2lb), shredded",
                "2 tbsp dark brown soft sugar",
                "2 Bramley apples, peeled and chopped"
            ],
            "method": [
                "Heat the oil in a large flameproof casserole dish, add the onions and cook on a medium heat for 8-10 mins, then add the star anise and cinnamon stick.",
                "Pour in the wine and let it simmer until slightly reduced. Add the cabbage, sugar and apples, and stir well. Season well, cover and simmer on a low heat for 3 hrs, stirring every now and again.",
                "Once the cabbage is tender, check the seasoning. Serve in a bowl with the star anise and cinnamon stick on top. Can be made 1-2 days in advance or frozen for up to 4 months – simply reheat on the hob before serving."
            ]
        },
        {
            "name": "Cashew caramels",
            "url": "https://www.bbcgoodfood.com/recipes/cashew-caramels",
            "author": "Jennifer Joyce",
            "ingredients": [
                "375g toasted cashews",
                "125g butter",
                "350ml double cream",
                "1 tsp vanilla bean paste",
                "400g golden caster sugar",
                "250ml golden syrup",
                "sea salt, for sprinkling"
            ],
            "method": [
                "Line a 20cm square tin with foil and rub generously with vegetable oil. Add half the cashews to the tin. In a saucepan, bring the butter, cream and vanilla to the boil, then remove from the heat.",
                "In a large heavy-based saucepan, heat the sugar and syrup on a medium-low heat until it reaches 155C on a sugar thermometer. Do not stir or the sugar will crystallise. Turn off the heat and very carefully add to the cream mixture. Stir together and heat again until it reaches 125C on the thermometer. Remove from the heat and pour in the remaining nuts. Quickly pour into the tin, sprinkle over the salt and leave to cool.",
                "When firm (after 3-4 hrs), cut into pieces –use a knife that has been dipped into boiling water. Wrap in baking parchment until ready to eat. Will keep for 2 weeks in an airtight tin."
            ]
        },
        {
            "name": "Turkey ramen",
            "url": "https://www.bbcgoodfood.com/recipes/turkey-ramen",
            "author": "Cassie Best",
            "ingredients": [
                "2 garlic cloves",
                "thumb-sized piece ginger, sliced, plus a few slices cut into fine matchsticks to serve",
                "1 ½ tbsp white miso paste",
                "1 tbsp goma(white sesame paste) or tahini",
                "15g dried shiitake mushrooms",
                "700g leftover turkey gravy, or good-quality chicken stock",
                "2 tbsp soy sauce",
                "2 eggs, at room temperature",
                "150g ramen noodles(egg, rice or udon noodles will all work too)",
                "200g leftover turkeymeat, shredded",
                "2 spring onions, finely sliced, white and green parts kept separate",
                "1 lime, halved",
                "25g ready-to-eat beansprouts",
                "sesame oil, sriracha, chopped coriander, crushed peanuts, crumbled sheets of nori or dried chilli threads (silgochu), to serve (optional)"
            ],
            "method": [
                "Crush the garlic with the back of a big knife, then put it in a saucepan with the ginger, miso, goma, mushrooms, gravy and soy. Bring to a gentle simmer, cover and bubble for 5 mins until the ginger is soft. Strain into a clean pan and discard the aromatics and mushrooms.",
                "Meanwhile, cook the eggs in a pan of boiling water for 7 mins. Plunge straight into a bowl of cold water and set aside to cool. Cook the noodles for 1 min less than instructed on the pack, so they retain a little bite. Drain and leave in the pan with a little cooking water so they don’t stick together. Add the turkey and whites of the spring onions to the broth and gently reheat for 1-2 mins.",
                "Divide the noodles between two deep bowls, ladle over the broth and top with a squeeze of lime, the beansprouts, ginger matchsticks, green spring onion and a drizzle of sesame oil, plus the other toppings, if you like. Peel and halve the eggs and place these on top too."
            ]
        },
        {
            "name": "Sunday morning baked eggs",
            "url": "https://www.bbcgoodfood.com/recipes/sunday-morning-baked-eggs",
            "author": "Marcus Wareing",
            "ingredients": [
                "4 tbsp extra virgin olive oil",
                "8 large eggs",
                "large sprig tarragon, leaves chopped",
                "50g gruyère (or vegetarian alternative), grated",
                "100ml double cream",
                "100g bag watercress, to serve",
                "Brummie bacon cakes (see 'Goes well with') or toast, to serve"
            ],
            "method": [
                "Heat oven to 160C/140C fan/gas 3 and bring a kettleful of water to the boil. Pour 1 tbsp oil into 4 shallow ramekins and crack 2 eggs into each. Season with sea salt and coarse black pepper, sprinkle with the tarragon and cheese, then spoon over the cream.",
                "Set the ramekins in a roasting tin, then quarter-fill the tin with water from the kettle. Carefully transfer to the oven and bake for 6-8 mins or until the egg whites are softly set and the yolks are runny. Serve immediately with the watercress on the side and Brummie bacon cakes (see 'Goes well with', right), toast, or gluten-free alternative."
            ]
        },
        {
            "name": "Mini elf doughnuts",
            "url": "https://www.bbcgoodfood.com/recipes/mini-elf-doughnuts",
            "author": "Sarah Cook",
            "ingredients": [
                "2 tbsp melted butter, plus an extra 1 tbsp for greasing",
                "100g plain flour",
                "½ tsp baking powder",
                "1 tsp ground cinnamon",
                "¼ tsp ground nutmeg",
                "3 tbsp golden caster sugar",
                "1 large egg",
                "1 tsp vanilla extract",
                "2 tbsp maple syrup",
                "4 tbsp buttermilk",
                "250g icing sugar",
                "50ml milk",
                "red and green food colouring",
                "red, green & white sprinkles",
                "red and green writing icingtubes (optional)"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4. Brush some melted butter in the holes of a 24-hole mini muffin tin.",
                "Put the flour, baking powder, cinnamon, nutmeg and sugar in a big bowl and mix together with your hands.",
                "Pour the melted butter into a jug with the egg, vanilla, maple syrup and buttermilk, and mix together with a fork.",
                "Pour the wet ingredients over the dry ones and use a big wooden spoon to mix until there are no lumps.",
                "Use teaspoons to divide the mixture between the holes in the tin. Bake in the oven for 8-10 mins, then cool in the tin.",
                "Now it's time to turn them into doughnuts. Once cool, carefully tip the cakes out. Sit each on a chopping board and push an apple corer into the centre to cut the middle out so you have a ring.",
                "Put the icing sugar and milk in a saucepan over a low heat. Whisk until runny and smooth. Divide the icing between three bowls, and mix a little green food colouring into one bowl, and a little red colouring into another.",
                "Sit the doughnuts on a wire rack (so the drips can fall off), then spoon a little icing onto each. Decorate with sprinkles and writing icing, if you like. As this glaze dries quickly, finish decorating one colour, then start the next colour. If the icing is not runny enough, put in the microwave for 10 secs and stir well. Will keep for 2 days."
            ]
        },
        {
            "name": "Parsnip croquettes",
            "url": "https://www.bbcgoodfood.com/recipes/parsnip-croquettes",
            "author": "Marcus Wareing",
            "ingredients": [
                "350g parsnips, peeled and left whole",
                "2 tsp olive oil",
                "25g unsalted butter",
                "2 shallots, finely chopped",
                "25g creamed horseradish",
                "75g plain flour",
                "2 large eggs, beaten",
                "85g pankobreadcrumbs",
                "1-2 litres vegetable oil, for deep-frying",
                "50g unsalted butter",
                "50g plain flour",
                "300ml full-fat milk",
                "75g cheddar, grated",
                "½ tsp Dijon mustard",
                "½ tbsp Worcestershire sauce",
                "100g gruyère, grated"
            ],
            "method": [
                "Heat oven to 160C/140C fan/gas 3. Put the parsnips in a roasting tin with the oil and roast for 1 hr 30 mins. Remove from the oven and cut into chunks.",
                "Meanwhile, make the béchamel. Melt the butter in a saucepan over a low heat, then add the flour and whisk. Remove from the heat and add the milk gradually, whisking after each addition until combined. Return to a low heat and cook, stirring, until thick. Stir in the remaining ingredients, except the Gruyère, add 1/2 tsp salt and take off the heat. Add the Gruyère and mix well.",
                "Once the parsnips are cool enough to handle, purée in a food processor and set aside. Heat the butter in a pan. Add the shallots and cook for 10 mins or until soft and golden. Tip into a large bowl with the parsnip purée, béchamel and horseradish. Season to taste, cover and cool. When almost cold, spoon into a piping bag and pipe into 3cm-thick lengths onto a baking parchment-lined tray. Freeze for 1 hr until firm but not completely frozen. Remove from the freezer and cut into 5cm lengths. Coat the croquettes in the flour, dip in the egg, roll in the panko breadcrumbs, then place on a parchment-lined tray. Chill until needed. Can be made up to this stage up to 24 hrs in advance.",
                "To fry your croquettes, use a deep-fat fryer or half-fill a heavy-based medium saucepan with vegetable oil and heat to 180C. Cook in small batches for 2-3 mins until golden and cooked through. Lift the croquettes from the oil with a slotted spoon and drain on kitchen paper. Put on a warmed plate and cover with foil until ready to serve."
            ]
        },
        {
            "name": "Panettone",
            "url": "https://www.bbcgoodfood.com/recipes/panettone",
            "author": "Good Food",
            "ingredients": [
                "4 tbsp warm milk",
                "2 x 7g sachets fast-action dried yeast",
                "100g caster sugar",
                "250g butter, softened",
                "5 medium eggs, lightly beaten",
                "2 tsp vanilla extract",
                "grated zest of 1 lemon",
                "grated zest of 1 orange",
                "500g strong white bread flour, plus extra for dusting",
                "80g raisins",
                "80g sultanas",
                "3 tbsp dark rum",
                "100g good-quality candied lemon and orange peel, finely chopped",
                "30g whole blanched almonds, roughly chopped",
                "1 tbsp caster sugar",
                "1 tbsp egg white",
                "1 tbsp icing sugar"
            ],
            "method": [
                "Grease a panettone tin (see Tip) or a 20cm deep cake tin, or use a panettone case.",
                "Place the warm milk in a bowl and add the yeast and 1 tsp of sugar and leave for a few minutes.",
                "Put the remaining sugar in a large bowl and beat together with the butter and vanilla extract until really light, creamy and pale.",
                "Stir in the lemon and orange zest. Add the eggs a little at a time until all are well incorporated. Spoon in a tablespoon of the flour if the mixture starts to curdle and beat this in with the eggs.",
                "Place the flour in a large bowl and mix with a good pinch of salt and make a well in the centre. Add the yeast mixture then the butter and egg mixture, folding in with a large spoon to make a soft dough. Knead for 5 mins in the bowl until it all starts to come together. It will be a pretty sticky dough at this stage.",
                "Turn out the dough onto a floured surface and knead for a further 10 mins, until everything has come together and you have a very soft and stretchy dough. Add a light sprinkling of flour to the surface and your hands as you go to stop the mixture sticking, but try not to add too much. Place in a lightly greased bowl and cover with cling film. Leave in a warm place for 2 hrs until doubled in size.",
                "Place the raisins and sultanas in a small saucepan with the rum and heat gently for 5 – 7 mins until the fruit has absorbed the liquid and is plump and juicy. Set aside to cool.",
                "When the dough is risen, tip it out onto a lightly floured surface and knead for another 5 mins. Gradually knead in the soaked raisins, sultanas and chopped candied peel. Shape the dough into a ball and pop into the prepared tin. If using a 20cm cake tin, wrap a layer of baking parchment around the outside of the tin, to come up about 5cm above the rim, and secure the paper with string. This will help contain the dough as it rises. Cover lightly with cling film and leave to rise for another hour until it has risen to the top of the tin or paper.",
                "Preheat the oven to 180C/fan 160C/gas 4. Adjust the oven shelf to the right height. Mix together the almonds, caster sugar and egg white for the topping and gently brush over the top of the panettone. Place in the oven and bake for 40 - 50 mins until golden and risen and a skewer comes out clean when inserted into the middle of the cake. Leave to cool in the tin for 10 mins before turning out onto a wire rack. Leave to cool completely before dusting lightly with icing sugar and cutting into wedges to serve."
            ]
        },
        {
            "name": "Panforte",
            "url": "https://www.bbcgoodfood.com/recipes/panforte",
            "author": "Barney Desmazery",
            "ingredients": [
                "flavourless oil, for greasing",
                "edible rice paper(optional)",
                "300g nuts, toasted and chopped (we used pistachios and hazelnuts)",
                "50g candied peel, finely chopped",
                "250g dried fruit, chopped (we used dates and apricots)",
                "50g plain flour",
                "2 tsp spices(we used 1 tsp cinnamon, ¾ tsp ginger and ¼ tsp cardamom)",
                "125g honey",
                "150g golden caster sugar",
                "3 tbsp fortified wineor liqueur (we used Marsala)",
                "icing sugar, to dust"
            ],
            "method": [
                "Heat oven to 150C/130C fan/gas 2. Grease and line the base of a 20cm springform cake tin with edible rice paper or baking parchment. Tip the nuts, candied peel and dried fruit into a bowl. Sift over the flour and spices, and mix together.",
                "Heat the honey, sugar and wine in a medium saucepan over a medium heat. Bubble for 3-4 mins until the sugar has melted. Pour the hot liquid over the fruit and nuts, then mix. Scrape the mixture into the tin and use the back of a wet metal spoon to flatten it. Bake for 35-40 mins until the surface is still soft but not sticky – it will firm up as it cools.",
                "Leave to cool in the tin for 10 mins, then remove using a palette knife to release any sticky edges. If using baking parchment, peel it off and discard it; the edible rice paper can be left on. Cool completely on a wire rack, then dust generously with icing sugar, rubbing the sugar gently into the surface. Cut into wedges to serve. Will keep wrapped in baking parchment in an airtight tin for one month."
            ]
        },
        {
            "name": "Lobster & celeriac remoulade",
            "url": "https://www.bbcgoodfood.com/recipes/lobster-celeriac-remoulade",
            "author": "Barney Desmazery",
            "ingredients": [
                "1 small, whole cooked lobster(about 400g, defrosted if frozen)",
                "½ a small celeriac",
                "½ lemon, juiced",
                "3 tbsp mayonnaise",
                "1 tbsp Dijon mustard",
                "splash of Tabasco",
                "½ small pack dill, chopped, reserving a few fronds to finish",
                "toasted sourdoughor your favourite bread, to serve (optional)"
            ],
            "method": [
                "To prepare the lobster, remove the roe if there is any (if you want to include it in the remoulade, set it aside). Twist off and peel the tail, halve lengthways, slice thickly and set aside. Crack the claws and try to remove the meat whole, setting it aside with the tail. Winkle out the rest of the meat from the knuckles and the legs, and keep separate.",
                "Pour the lemon juice into a bowl. Finely cut the celeriac into matchsticks, or coarsely grate or spiralize it. Tip it straight into the lemon juice and toss to prevent it browning. Add the mayo, mustard and Tabasco, season and mix well. Now stir in the broken bits of lobster meat, most of the roe (if using) and the chopped dill. ",
                "Neatly spoon the celeriac in the middle of two small plates. Arrange the lobster claw on one side and the tail meat on top and scatter with the dill fronds and the rest of the roe. Serve with toast, if you like."
            ]
        },
        {
            "name": "Vanilla fudge",
            "url": "https://www.bbcgoodfood.com/recipes/3148690/vintage-vanilla-fudge",
            "author": "Cassie Best",
            "ingredients": [
                "450g golden caster sugar",
                "400g double cream",
                "50g butter",
                "1 tbsp glucosesyrup",
                "1 tbsp vanillabean paste"
            ],
            "method": [
                "Line a 20 x 20cm cake tin with baking parchment. Tip the sugar, cream, butter and glucose syrup into a medium to large saucepan. Heat to dissolve the sugar and melt the butter, stirring now and again.",
                "Once dissolved, put a sugar thermometer in the pan, making sure the end is completely covered by the syrup – if not, transfer the mixture to a smaller pan (with enough space for the syrup to bubble up). Increase the heat and bring the syrup to a steady boil. Keep bubbling, stirring occasionally to stop the sugar from catching, until the mixture reaches 116C – this is known as the soft ball stage.",
                "Remove the pan from the heat and leave to sit, undisturbed, for 5 mins, until the temperature drops to 110C. Stir in the vanilla and a good pinch of salt.",
                "Keep the sugar thermometer in the pan and begin beating the mixture with a wooden spoon, quite vigorously, until the temperature cools to about 60C. By this time the fudge will be really thick and will have lost it glossy shine. Remove the thermometer and continue beating for a few mins more. This process is very important when making fudge, as it creates small sugar crystals, which give the fudge its lovely smooth and creamy texture (see 'fudge know-how', below).",
                "Before it sets completely, quickly pour the fudge into your prepared tin and smooth over the surface. Leave to cool at room temperature overnight – don’t put the fudge in the fridge as it will become sticky and won’t set properly. Cut into bite-sized pieces and pop in a box to give as a present. "
            ]
        },
        {
            "name": "Mulled pomegranate juice",
            "url": "https://www.bbcgoodfood.com/recipes/mulled-pomegranate-juice",
            "author": "Miriam Nice",
            "ingredients": [
                "1l pomegranate juice",
                "1 sprig rosemary",
                "1 tsp sumac",
                "1 cinnamon stick",
                "½ tsp coriander seeds",
                "½ orange, sliced",
                "¼ tsp orange blossom water"
            ],
            "method": [
                "Pour the pomegranate juice into a large saucepan. Add the rosemary, sumac, cinnamon stick, coriander seeds, and orange. Bring to a simmer then pour through a sieve into a jug. Stir in the orange blossom water and pour into heatproof glasses or cups."
            ]
        },
        {
            "name": "Bellini",
            "url": "https://www.bbcgoodfood.com/recipes/bellini",
            "author": "Good Food",
            "ingredients": [
                "500ml peachpurée or peach nectar",
                "1 bottle prosecco"
            ],
            "method": [
                "Put the peach puree in a Champagne flute up to about 1/3 full and slowly top up with Prosecco."
            ]
        },
        {
            "name": "Ham, turkey & sprout pie",
            "url": "https://www.bbcgoodfood.com/recipes/ham-turkey-sprout-pie",
            "author": "Good Food",
            "ingredients": [
                "1 onion, diced",
                "1 celery stick, diced",
                "50g butter",
                "50g plain flour",
                "500ml turkey or chicken stock(or 100ml/3½ fl oz leftover gravy mixed with 400ml/14fl oz water)",
                "175ml single, double, whipping or soured cream, or crème fraîche – or a mixture",
                "1 tbsp Dijon or wholegrain mustard",
                "100g mature cheddaror Stilton, grated, plus 25g/1oz extra to sprinkle on top",
                "400g turkeyor chicken, cut into bite-sized chunks",
                "200g ham, diced slightly smaller than the turkey/chicken",
                "100g Brussels sprouts, halved",
                "320g sheet ready-rolled shortcrust pastry",
                "splash of milk or beaten egg, to glaze",
                "mashed potatoand greens, to serve (optional)"
            ],
            "method": []
        },
        {
            "name": "Celeriac & potato gratin",
            "url": "https://www.bbcgoodfood.com/recipes/celeriac-potato-gratin",
            "author": "Sara Buenfeld",
            "ingredients": [
                "50g butter, plus extra for greasing",
                "2 large onions, halved and thinly sliced",
                "1 tsp golden caster sugar",
                "500ml milk",
                "good grating of nutmeg",
                "2 garlic cloves, finely chopped",
                "5 thyme sprigs, chopped",
                "300ml pot double cream",
                "1 celeriac(about 450g), peeled",
                "1¼kg even-sized potatoes",
                "50g finely grated parmesan(or vegetarian alternative)"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4 and grease a shallow ovenproof dish about 35 x 24cm. Melt the butter in a non-stick frying pan, add the onions and fry for 10 mins, stirring frequently, until soft and starting to turn golden. Sprinkle over some seasoning and the sugar, stir again, then cook 5-10 mins more until golden. Meanwhile, heat the milk with the nutmeg, garlic, thyme and seasoning. When the mixture starts to boil, pour in the cream and turn off the heat.",
                "Quarter the celeriac and thinly slice, then arrange in the base of the dish. Pour over half the milk mixture, then spoon over the golden onions. Thinly slice the ends of the potatoes, reserving the middles. Pile the sliced potatoes into the dish, then thinly slice the reserved middle sections and arrange neatly on top. (By cutting the potatoes this way, you should have neat slices roughly all the same size for the top of the gratin.) Pour over the remaining milk mixture, scatter over the Parmesan and bake for 1 hr 30 mins until a knife easily cuts through the layers. Allow to rest for 10 mins before serving to allow the creamy sauce to soak into the potatoes."
            ]
        },
        {
            "name": "Roast sweet potato & onion tart with goat’s cheese",
            "url": "https://www.bbcgoodfood.com/recipes/roast-sweet-potato-onion-tart-goats-cheese",
            "author": "Justine Pattison",
            "ingredients": [
                "3 tbsp olive oil",
                "6 medium red onions, finely sliced",
                "5 tbsp red wine vinegar",
                "100g cranberry sauce",
                "1kg sweet potatoes, peeled and cut into small chunks",
                "1 tsp chilli flakes",
                "2 x 320g sheets ready-rolled puff pastry",
                "3 x 100g soft goat's cheesewith rind, broken into large chunks",
                "beaten egg, for glazing",
                "thyme sprigs, to serve",
                "a large salad, to serve"
            ],
            "method": [
                "Heat oven to 200C/180C fan/gas 6. Heat 2 tbsp of the oil in a large non-stick frying pan and cook the onions over a low heat for 20-25 mins or until well softened and lightly browned. Add the vinegar and cranberry sauce, and simmer for 5-10 mins more, stirring until almost all the liquid has disappeared. Leave to cool.",
                "Meanwhile, put the sweet potatoes in a bowl and toss with the remaining oil, 1/2 tsp salt, 1/2 tsp pepper and the chilli flakes. Arrange on a baking tray and cook for 20 mins, turning halfway, until softened and lightly browned. Leave to cool.",
                "Reduce oven to 180C/160C fan/gas 4. Line two large baking trays with baking parchment and unroll the pastry sheets on top – trimming the edges neatly at this point will encourage a good rise. Leaving a 2cm gap around the edge, spread the onions over the pastry, then top with the sweet potatoes and goat’s cheese. Brush the beaten egg around the border of the pastry and bake in the oven for 35-40 mins or until the pastry is golden and crisp, swapping the shelves after 20 mins.",
                "Scatter over the thyme, then cut each tart into quarters (or smaller pieces if serving more). Serve with a large leafy salad."
            ]
        },
        {
            "name": "Favourite biscuit cupcakes",
            "url": "https://www.bbcgoodfood.com/recipes/favourite-biscuit-cupcakes",
            "author": "Lulu Grimes",
            "ingredients": [
                "175g self-raising flour",
                "1 tsp baking powder",
                "175g unsalted butter, softened",
                "3 eggs",
                "175g golden caster sugar",
                "2 tbsp milk, plus a splash",
                "1 tsp vanilla extract",
                "40g ground almonds",
                "12 mini Oreos, 12 mini Jammy Dodgers, 12 mini gingerbread",
                "225g unsalted butter, softened",
                "400g icing sugar, sifted",
                "few drops vanilla extract, 1 tbsp cocoa and a pinch each of powdered ginger and cinnamon",
                "12 cupcake cases(3 different colours if using 3 types of biscuits)"
            ],
            "method": [
                "Heat oven to 180C/160C fan/gas 4. Line a 12-hole muffin tin with three different coloured paper cases. Tip the flour, baking powder, unsalted butter, eggs, sugar, milk, vanilla and almonds into a large bowl and beat with an ",
                " until smooth. Put a spoonful of batter into each paper case. Crumble a biscuit into each case – use one type of biscuit for each case colour, so you remember what’s in each one. Divide the remaining batter between the cases (they should be about half full), and bake for 20-25 mins or until golden and just firm. Leave to cool on a wire rack.",
                "Make the icing by beating the butter until soft, then beat in the icing sugar. Divide the icing into three. Add the vanilla to one batch, the cocoa and a splash of milk to another, and the ginger and cinnamon to the third. Mix them all well.",
                "Spoon each batch of icing into a bag fitted with a star nozzle (or use one batch at a time) and pipe icing onto the cakes, matching the icing flavour with the biscuit inside. Add two of the same biscuit to the top as a decoration. Will keep for up to two days in an airtight container."
            ]
        },
        {
            "name": "Fruitcake with apricot butter icing",
            "url": "https://www.bbcgoodfood.com/recipes/1837666/fruitcake-with-apricot-butter-icing",
            "author": "Sarah Cook",
            "ingredients": [
                "200g butter, softened",
                "100g whole almond",
                "200g plain flour",
                "200g icing sugar",
                "4 medium eggs",
                "700g mixed dried fruit",
                "25ml brandy",
                "150g butter, softened",
                "150g apricot jam",
                "275g icing sugar, sifted"
            ],
            "method": [
                "Heat oven to 160C/140C fan/gas 3. Grease a deep 20cm round cake tin with a little bit of the butter, then line with greaseproof paper or baking parchment. Wrap a couple of sheets of newspaper around the outside of the tin, then secure with string.",
                "In a food processor, whizz the almonds with the flour until the mix resembles crumbs. Beat the butter and icing sugar until light and fluffy. Beat in the eggs, one by one, then fold in the flour and almonds, dried fruit and brandy. Scrape into the tin, level the surface and bake for 1 hr 15 mins, until a skewer poked in comes out clean. Cool in the tin.",
                "When the cake is completely cold, make the icing quickly by beating the butter, jam and icing sugar until pale. Don’t allow the butter to get too warm or overbeat as the icing might split. Swirl all over the cake, then leave in a cool place to set (but not the fridge)."
            ]
        },
        {
            "name": "Goat’s cheese & olive tapenade spirals",
            "url": "https://www.bbcgoodfood.com/recipes/goats-cheese-olive-tapenade-spirals",
            "author": "Miriam Nice",
            "ingredients": [
                "3 tbsp black olive tapenade",
                "4 large tortillaswraps",
                "300g soft goat's cheese",
                "200g pitted black olive"
            ],
            "method": [
                "Spread the black olive tapenade over the tortilla wraps, then crumble over the soft goat’s cheese and scatter with the olives. Tightly roll up the wraps – neaten them by cutting off the ends. Can be made a few hours ahead and wrapped in cling film. To serve, slice each one into 10 portions. Secure the spirals with cocktail sticks and serve."
            ]
        },
        {
            "name": "Mincemeat, apple & cranberry lattice tart",
            "url": "https://www.bbcgoodfood.com/recipes/mincemeat-apple-cranberry-lattice-tart",
            "author": "Katy Greenwood",
            "ingredients": [
                "flour, for dusting",
                "500g puff pastry",
                "2 Granny Smithsapples, peeled, cored and diced",
                "140g fresh cranberries(or frozen and defrosted)",
                "½ tsp cinnamon",
                "½ tsp mixed spice",
                "1 tbsp golden caster sugar, plus extra for sprinkling",
                "zest ½ lemon",
                "411g jar mincemeat",
                "1 egg, beaten",
                "whipped creamor brandy cream, to serve"
            ],
            "method": [
                "Heat oven to 200C/180C fan/gas 6 and put a baking sheet in to heat up. Lightly flour a work surface, roll out the puff pastry to a 30 x 45cm rectangle, then put on a sheet of baking parchment. Mix together the apples and cranberries, then add the cinnamon, mixed spice, sugar, lemon zest and mincemeat, and mix again.",
                "Arrange the pastry in front of you with a short edge nearest to you. Spread the mincemeat mixture in a line down the centre, about 12cm wide, leaving 2cm of pastry at the top and bottom.",
                "To create the lattice pattern, start at the top of the pastry and cut a 1.5–2cm-wide horizontal strip of pastry on both sides of the mincemeat filling (so it is still attached next to the filling). About 1.5cm in from the filling, cut out a 0.5cm strip of pastry and remove this, then cut another 1.5–2cm strip (you’re creating a pattern like the teeth of a comb). Repeat this method until you get to the bottom of the pastry. You’ll need to cut out the final strip and remove this. Fold the top and bottom flaps of pastry up and over the filling. Fold the strips of pastry diagonally over the filling, starting from the top until you reach the bottom, creating a lattice pattern. You can now chill the tart for up to 2 days, or freeze for up to 2 months.",
                "Brush the tart with the egg and sprinkle with the extra sugar. Using the baking parchment, transfer the tart to the hot baking tray. Bake for 20–25 mins or until golden brown on top (add an extra 10-15 mins if baking from frozen). Leave to cool for 5 mins before serving with whipped cream or brandy cream."
            ]
        },
        {
            "name": "Sugar charms",
            "url": "https://www.bbcgoodfood.com/recipes/sugar-charms",
            "author": "Miriam Nice",
            "ingredients": [
                "sunflower oil, for greasing",
                "7-8 fruit-flavoured boiled sweets, unwrapped and sorted by colour",
                "400g bag clear mint sweets(I used Fox’s glacier mints)",
                "2 metres of coloured thread or thin ribbon, for hanging"
            ],
            "method": [
                "Grease two large baking trays with the oil. Crush the fruit-flavoured sweets by colour and put into separate bowls. Arrange small clumps of coloured sweets onto the trays.",
                "Put the mints in a saucepan over a medium heat. Cook gently until melted, stirring occasionally with a metal spoon. Once melted completely, remove from the heat immediately, otherwise the mixture will burn and discolour.",
                "Working quickly, design your charm shapes (making sure they have a hole for threading the ribbon) by drizzling spoonfuls of the melted mints over the clumps of coloured sweets on the trays – they will melt into your shape and add interest to your design.",
                "If the mixture hardens while you are working, return it to a low heat to soften, but try to make as many as you can in one go – the more you heat the mixture, the less clear the final charms will be. Leave to set for about 10 mins until hard and cool enough to handle, then remove from the tray by hand – be careful as they will be quite brittle. Tie a length of ribbon through each charm for hanging on the tree. Pack in a box between sheets of baking parchment so they don’t stick together. Eat within 3-4 days, or keep as a decoration for up to 4 weeks."
            ]
        },
        {
            "name": "Winter whiskey sour",
            "url": "https://www.bbcgoodfood.com/recipes/winter-whiskey-sour",
            "author": "Chelsie Collins",
            "ingredients": [
                "crushed ice",
                "50ml bourbon",
                "1 tbsp fresh lemon juice",
                "1 tbsp fresh orange juice",
                "½ tbsp sugar syrup",
                "2 slices of oranges",
                "honey",
                "gold edible glitter"
            ],
            "method": [
                "Using a small paintbrush (or your finger), brush some honey around the rim of two tumblers and use another small paintbrush to stick edible gold glitter around each.",
                "Fill each glass with crushed ice. Put the bourbon into a cocktail shaker with the lemon juice, orange juice and sugar syrup. Shake and strain into each glass, and serve with an orange slice and short straws."
            ]
        },
        {
            "name": "Orange & cardamom tree biscuits",
            "url": "https://www.bbcgoodfood.com/recipes/2767671/orange-and-cardamom-tree-biscuits",
            "author": "Mary Cadogan",
            "ingredients": [
                "6 cardamom pods",
                "200g plain flour",
                "50g rice flour",
                "140g butter",
                "grated zest 1 orange",
                "100g icing sugar, plus extra to decorate",
                "1 egg yolk",
                "pastrycutters",
                "cocktail sticks",
                "Christmas rubber stamps (see tip below) and thin ribbonor string"
            ],
            "method": [
                "Split the cardamom pods and tip the seeds into a mortar, then grind to a powder with the pestle. Tip the flour, rice flour and cardamom powder into a food processor. Chop the butter into small pieces and add to the food processor with the orange zest. Pulse to a fine breadcrumb texture. Add the icing sugar and mix briefly, then add the egg yolk and 1-2 tsp cold water and pulse to a firm dough. Wrap in cling film and chill for 15 mins.",
                "Heat oven to 180C/160C fan/gas 4. Line 2 baking sheets with baking parchment. Roll out half the dough at a time and stamp out 8cm rounds or squares and transfer to the baking sheets. Gather up the trimmings and roll out again to make more biscuits. Use a cocktail stick to make a hole in each biscuit for hanging from the tree. Press a festive rubber stamp into the surface of each biscuit. Chill for 30 mins.",
                "Bake for 8-10 mins until just golden and crisp. Transfer to a wire rack and leave to cool.",
                "Dust each biscuit liberally with icing sugar, then brush off the excess from the surface, leaving a white imprint on each biscuit. Tie up with pretty ribbon or string and hang from your tree."
            ]
        },
        {
            "name": "Chicory cups with prawns & mango",
            "url": "https://www.bbcgoodfood.com/recipes/chicory-cups-prawns-mango",
            "author": "Miriam Nice",
            "ingredients": [
                "4 chicoryheads",
                "2 x 150g packs cooked and peeled king prawns",
                "2 x 300g packs freshly prepared mangopieces",
                "a few sprigs of salad cress",
                "4 tbsp olive oil",
                "juice 2 lemons",
                "2 tsp finely chopped coriander"
            ],
            "method": [
                "Separate the chicory heads into leaves, then divide the king prawns, mango pieces and a few sprigs of salad cress between them.",
                "Assemble a few hours ahead and chill. Whisk together the olive oil, lemon juice and finely chopped coriander and drizzle a little over each filled chicory leaf."
            ]
        },
        {
            "name": "Mini croque monsieurs",
            "url": "https://www.bbcgoodfood.com/recipes/mini-croque-monsieurs",
            "author": "Miriam Nice",
            "ingredients": [
                "150g grated gruyère",
                "200ml tub crème fraîche",
                "1 tsp Dijon mustard",
                "salt and black pepper",
                "a pinch of nutmeg",
                "10 thick slices of white bread(crusts removed)",
                "cooked sliced ham",
                "butter, softened"
            ],
            "method": [
                "Heat oven to 190C/170C fan/gas 5. Mix together 100g of the grated Gruyère, crème fraîche and Dijon mustard. Season with salt, black pepper and a pinch of nutmeg and spread half the mixture over 5 slices of white bread. Top with a layer of cooked sliced ham and another slice of bread.",
                "Spread softened butter over one side of the sandwich and place on a baking sheet, butter-side down. Top the unbuttered side with the rest of the cheese mixture the remaining 50g grated Gruyère. Can be assembled the day before and chilled. To serve, bake in the oven for 20 mins or until golden, then slice the sandwiches into bite-sized pieces and serve straight away."
            ]
        },
        {
            "name": "Gingerbread trees",
            "url": "https://www.bbcgoodfood.com/recipes/3000/gingerbread-trees",
            "author": "Good Food",
            "ingredients": [
                "75g softened butter",
                "50g caster sugar",
                "½ tsp bicarbonate of soda",
                "50g golden syrup",
                "2 egg yolks",
                "250g plain flour",
                "½ tsp ground cinnamon",
                "½ tsp ground ginger"
            ],
            "method": [
                "Heat oven to 180C/fan 160C/gas 4. Beat together the softened butter with the caster sugar until creamy. Stir in bicarbonate of soda, golden syrup and the egg yolks. Sift in the plain flour and ground cinnamon and ground ginger then bring together with a wooden spoon. Shape into two balls, knead until the dough comes together, then chill for 30 mins. Roll out one ball at a time, to about 2 x £1 coin thickness. Stamp out trees with a 7cm cutter, then re-roll the trimmings. Lift dough onto greased baking sheets and bake for 10-12 mins until slightly risen and golden brown. Cool on a wire rack. Will keep in an airtight container up to a week."
            ]
        },
        {
            "name": "White chocolate & ricotta cheesecake",
            "url": "https://www.bbcgoodfood.com/recipes/77602/white-chocolate-and-ricotta-cheesecake",
            "author": "Good Food",
            "ingredients": [
                "50g butter, melted",
                "150g digestive biscuit",
                "50g amaretti biscuit",
                "sunflower oil, for greasing",
                "200g white chocolate, chopped",
                "5 leaves gelatine",
                "6 tbsp milk",
                "500g tub ricotta",
                "300ml pot double cream",
                "50g icing sugar",
                "2 large eggs, separated",
                "white chocolatecurls",
                "pomegranateseeds",
                "icing sugar, for dusting (optional)"
            ],
            "method": [
                "Heat oven to 200C/180C fan/gas 6. Melt the butter in a pan or microwave. Very finely crush the biscuits together, stir with the butter, then press very firmly into the base of a 20cm round loosebottomed cake tin. Bake for 6 mins. Cool, then wipe around the inside of the tin with a little oil on kitchen paper.",
                "Soak the gelatine in water while you make the filling. Tip the chocolate into a bowl over a pan of simmering water, then add the milk. Gently heat until melted, then stir together. Squeeze the gelatine dry, add to the chocolate mixture and stir to dissolve.",
                "Beat the ricotta, cream, sugar and egg yolks together. In a separate bowl, whisk the egg whites.",
                "Stir the chocolate and ricotta mixtures together, then gently fold in the egg whites. Carefully pour onto the cooled biscuit base. Cover the tin with cling film, then chill until firm, preferably overnight.",
                "To decorate, very generously top the cheesecake with the white chocolate curls, then remove from the tin, scatter with the pomegranate seeds and dust all over with icing sugar, if you like."
            ]
        },
        {
            "name": "Coconut cupcakes",
            "url": "https://www.bbcgoodfood.com/recipes/coconut-cupcakes",
            "author": "Edd Kimber",
            "ingredients": [
                "400g can full-fat coconut milk(must not contain stabilisers)",
                "140g icing sugar",
                "1 tsp vanilla bean paste",
                "50g desiccated coconut",
                "100g coconut oil",
                "225g golden caster sugar",
                "3 large eggs",
                "200g gluten-free self-raising flour(the mix should include xanthan gum – I used Doves Farm)",
                "100ml coconut milk",
                "1 tsp vanilla extract"
            ],
            "method": [
                "Chill the can of coconut milk overnight. The next day, make the cakes. Heat oven to 180C/160C fan/gas 4 and line a 12-hole muffin tin with muffin cases. Put the coconut oil and sugar in a large bowl and use an electric whisk to beat together for about 5 mins until light and creamy. Add the eggs, one at a time, beating until fully combined before adding more. Working in three additions, add the flour, alternating with the coconut milk, then add the vanilla extract.",
                "Scoop the batter into the prepared muffin tin using an ice cream scoop, then bake for 20-22 mins or until the cakes are golden and a skewer inserted into the middle comes out clean. Remove the cupcakes from the tin and cool on a wire rack.",
                "The whipped cream is best made within a few hours of serving. Open the can of coconut milk upside down and pour off the thin liquid. Scoop the thick coconut milk into a large bowl, add the icing sugar and the vanilla, and whisk for 2-3 mins until soft and fluffy. Spread or scoop the whipped cream onto the cupcakes and sprinkle with the desiccated coconut. Best stored in the fridge and eaten within a couple of days."
            ]
        },
        {
            "name": "Spiced salmon coulibiac",
            "url": "https://www.bbcgoodfood.com/recipes/spiced-salmon-coulibiac",
            "author": "Mark Sargeant",
            "ingredients": [
                "2 tbsp vegetable oil",
                "1 onion, finely chopped",
                "2 garlic cloves, crushed",
                "2 cardamom pods, crushed",
                "1 cinnamon stick",
                "1 tsp fennel seeds",
                "2 star anise",
                "1 tsp fenugreek seeds",
                "3 cloves",
                "thumb-sized piece ginger, cut into large chunks",
                "2 tsp garam masala",
                "140g basmati rice, soaked in cold water for 30 mins, then drained",
                "1 bay leaf",
                "small pack coriander, finely chopped",
                "1 red chilli, seeds kept in, finely chopped",
                "1 tbsp mango chutney",
                "1 tbsp lemon juice",
                "2 x 320g packs ready-rolled puff pastry",
                "2 x 500g whole salmon fillets, skin removed and pin-boned",
                "2 large egg yolks, lightly beaten"
            ],
            "method": [
                "Heat the oil in a frying pan and add the onion, garlic, cardamom, cinnamon, fennel, star anise, fenugreek, cloves, ginger and 1 tsp garam masala. Cook over a medium heat until the onion is a deep golden brown. Add the rice with 250ml water and the bay leaf, and season with salt. Bring to the boil, then turn down to a gentle simmer. Cover and cook for 15 mins or until the liquid has been absorbed and the rice is light and fluffy. Remove from the heat, tip into a bowl and leave to cool. Once cooled, remove the cardamom, cinnamon stick, star anise, cloves, ginger and bay leaf. Add the coriander, chilli, mango chutney and lemon juice. Check the seasoning, cover and chill until needed.",
                "Take the pastry out of the fridge and leave at room temperature for 10 mins. Unroll the pastry sheets, roll out to make a little wider and put each on a non-stick baking sheet. Cover with cling film and place in the fridge to re-chill for 30 mins. Season the salmon on both sides with a little salt and pepper and the rest of the garam masala, then place one piece of salmon on one piece of pastry and cover with half of the rice mixture. Top with the other piece of salmon, then brush around the pastry edges with beaten egg. Cover with the second piece of pastry, pushing down well, then roll the edges over, crimp with a fork to seal and decorate as you like. Can be made ahead and chilled for 1 day. Brush all over with beaten egg and chill for 30 mins.",
                "Heat oven to 220C/200C fan/gas 7. Bake in the oven for 10 mins, then turn the oven down to 180C/160C fan/gas 4 and continue to bake for about 30 mins until the pastry is golden brown. Set aside in a warm place to rest for 10 mins. Serve with the rest of the rice mix (heated or cold) and the Raita (see goes well with)."
            ]
        },
        {
            "name": "Chorizo with celeriac remoulade",
            "url": "https://www.bbcgoodfood.com/recipes/chorizo-celeriac-remoulade",
            "author": "Good Food",
            "ingredients": [
                "1 celeriac",
                "1-2 tbsp mayonnaise",
                "juice 1 lemon",
                "3 tsp Dijon mustard",
                "40 slices of chorizo"
            ],
            "method": [
                "Peel and coarsely grate the celeriac and mix with the mayonnaise, lemon juice and Dijon mustard. This can be made a day ahead and chilled. To serve, put 1 tsp of the celeriac mixture onto individual thin slices of chorizo, making 40 in total. Fold the chorizo over to encase the remoulade and secure with a cocktail stick."
            ]
        },
        {
            "name": "Raymond’s roast goose",
            "url": "https://www.bbcgoodfood.com/recipes/raymonds-roast-goose",
            "author": "Raymond Blanc",
            "ingredients": [
                "4½ -5kg free-range organic goose, excess fat trimmed and discarded, legs removed; wings, neck and excess carcass removed and chopped into 2cm/¾ in pieces (about 600g/1lb 5oz)",
                "2 bay leaves",
                "5 thyme sprigs",
                "1 garlic clove, sliced",
                "white pepper, for seasoning",
                "2 tbsp goose fat",
                "1 small onion, cut into 3cm/1¼in pieces",
                "1 carrot, cut into 3cm/1¼in pieces",
                "25g celery, cut into 3cm/1¼in pieces",
                "85g unsalted butter, softened",
                "200ml port",
                "100ml madeira",
                "½ tsp arrowroot, if needed",
                "sprigs of fresh herbssuch as bay, rosemary and thyme, to serve"
            ],
            "method": [
                "Take the goose out of the fridge 2 hrs before roasting. Heat oven to 150C/130C fan/gas 2. Chop 1 bay leaf and the leaves from 2 thyme sprigs together. Mix with the garlic, 1/2 tsp coarse sea salt and 2 pinches of white pepper, then rub into the flesh of the goose legs.",
                "Heat the goose fat in a large flameproof roasting tin on a medium heat. Add the wings, neck and excess carcass and cook for 5 mins until lightly golden. Do not colour the bones too much, or the resulting jus will taste bitter. Add the onion, carrot and celery, and continue to brown for 3 mins.",
                "Place the goose legs, skin-side up, in the roasting tin with the bones and vegetables. Cover the tin tightly with foil and roast for 1 hr.",
                "Rub the goose crown with the butter and season well with sea salt and freshly ground white pepper. Remove the tin from the oven and increase the temperature to 230C/210C fan/gas 8. Remove the foil from the tin and sit the goose crown on top of the legs and bones, which will help the heat to circulate the crown, cooking it more evenly. Roast for 30 mins until the crown is golden.",
                "Reduce oven to 150C/130C fan/gas 2. Add the remaining bay leaf, 3 thyme sprigs and 300ml hot water to the tin to lift the caramelised juices from the pan and the bones. (It will also keep the goose moist.) Continue to cook for 30-35 mins, basting every 10 mins with the juices, until a probe thermometer inserted into the breast reads 55C.",
                "Remove the crown from the oven and wrap tightly in foil. Rest for 30 mins to allow the meat to become tender. Continue to cook the goose legs during this time. Meanwhile, heat the Port and Madeira in a small pan and simmer to reduce by half. Remove the goose legs from the oven, then place on a tray, wrap in foil and leave to rest in a warm place.",
                "Pour off the excess fat from the roasting tin and reserve (see tip, below). Remove the bones and veg from the tin and place the tin on a medium heat. Bring to the boil and stir to lift the juices. Add the reduced alcohol. Taste and adjust the seasoning if required, then pour the resting juices which have collected under the goose into the jus. If the sauce is a little thin, mix the arrowroot with 1 tsp cold water, then add a little at a time to ensure that it does not become too thick. Sieve into a warmed gravy boat. Scatter herbs over a serving platter, loosely reassemble the goose on top and serve with the sauce."
            ]
        },
        {
            "name": "Spanish skewers",
            "url": "https://www.bbcgoodfood.com/recipes/spanish-skewers",
            "author": "Justine Pattison",
            "ingredients": [
                "200g waxy potatoes, such as Charlotte, peeled and cut into 24 x 2cm/¾ in chunks",
                "1 tbsp mild olive oilor sunflower oil",
                "2 tsp finely chopped fresh rosemaryor ½ tsp dried rosemary",
                "1 large red pepper, deseeded and cut into 24 x 2cm/¾ in chunks",
                "1 large yellow pepper, deseeded and cut into 24 x 2cm/¾ in chunks",
                "200g cooking chorizo, cut into 24 pieces",
                "200g half-fat crème fraîche",
                "1 garlic clove, crushed",
                "½ small pack flat-leaf parsley, finely chopped",
                "24 short bamboo skewers"
            ],
            "method": [
                "Heat oven to 200C/180C fan/gas 6. Half-fill a large pan with water and bring to the boil. Add the potatoes and return to the boil. Cook for 1 min, then drain in a colander and tip into a bowl. Pour over the olive oil, sprinkle with the rosemary and season. Toss together.",
                "Scatter the potatoes over a large baking tray and cook for 5 mins. Turn the potatoes, add the peppers and cook for a further 10 mins or until just beginning to soften. Set aside to cool.",
                "Thread a chunk of yellow pepper, a chunk of potato and a chunk of red pepper onto bamboo skewers, finishing with a piece of chorizo. Place on a parchment-lined baking tray, cover and chill (up to 8 hrs). To make the dip, mix all the ingredients in a bowl, cover and chill.",
                "When ready to serve, heat oven to 200C/180C fan/gas 6. Bake the skewers for 10 mins or until the vegetables are softened and nicely browned, and the chorizo slices are cooked through. Serve with the dip."
            ]
        },
        {
            "name": "Gingerbread Bellini",
            "url": "https://www.bbcgoodfood.com/recipes/gingerbread-bellini",
            "author": "Miriam Nice",
            "ingredients": [
                "juice 1 lemon",
                "1 tbsp ginger cordial(we used Belvoir)",
                "50ml hazelnut liqueur(we used Frangelico)",
                "350ml prosecco",
                "25g roll-out icingor marzipan",
                "4 mini gingerbreadmen"
            ],
            "method": [
                "Put 4 Champagne flutes in the fridge for 15 mins. When you’re ready to serve, mix together the lemon juice, ginger cordial and hazelnut liqueur in a small jug. Take the Champagne flutes out of the fridge, pour in the mixture, then top up each glass with Prosecco.",
                "Roll the icing into 4 small balls, then gently press them onto the rims to help you secure the mini gingerbread men. Serve immediately."
            ]
        },
        {
            "name": "Sage and Onion Sauce",
            "url": "https://www.bbcgoodfood.com/recipes/3250/sage-and-onion-sauce",
            "author": "Ruth Watson",
            "ingredients": [
                "all the innards, wings and bones from the ducks",
                "100ml marsala",
                "1 medium onion, peeled and chopped",
                "1 large leek, trimmed, washed and chopped",
                "1 bay leaf, fresh or dried",
                "1 sprig fresh thyme",
                "large sprigs fresh parsley",
                "25g butter",
                "1 tbsp olive oil",
                "2 medium onions, peeled and finely diced",
                "100g marsala",
                "300ml dry white wine",
                "6 large fresh sage leaves, finely chopped",
                "142ml carton double cream"
            ],
            "method": [
                "Preheat the oven to 230C/Gas 8/fan oven 210C. Brown the duck bits in the oven for about 30 minutes. Transfer to a stockpot. Discard the fat and place the tin over a medium-high flame. Pour in the Marsala and 200ml/7fl oz cold water, bring to the boil and scrape any stuck-on bits into the liquid. Boil for 2 minutes then scrape everything into the stockpot.",
                "Add 2.25 litres/4 pints cold water to the pot and bring to the boil over a medium heat, uncovered. Scoop off any scum, then add the vegetables and herbs. Bring back to the boil, de-scum again.",
                "Now very gently simmer for 2 hours, adding cold water if the liquid falls below the level of the bones. Remove from the heat and drain through muslin-lined colander (or use a clean tea towel) into a heatproof bowl. Cool, then refrigerate until jellied.",
                "Heat the butter and oil in a large, nonstick frying pan over a low-medium heat, then tip in the onions. Cook for about 30 minutes, stirring occasionally, until meltingly soft. Turn heat to high, add the Marsala and boil for 3-4 minutes, stirring often, until onions are syrupy. Set aside.",
                "Meanwhile, remove the solidified fat from the stock and discard. Boil the stock in a saucepan, uncovered, until reduced to 500ml/18fl oz. Add the white wine and boil for 10 minutes, uncovered. Add the onions and sage and bring back to the boil. (Prepare in advance up to this point.)",
                "To finish the sauce, pour in the cream and boil furiously for 4-5 minutes, season to taste. Serve in a warmed jug."
            ]
        }
    ]
}